{
  "source_pdf": "C:\\Users\\Main\\yanky fridman\\בשלח_pages_4_to_14.pdf",
  "total_pages": 11,
  "completed_pages": 11,
  "pages": [
    {
      "page": 1,
      "text": "להלן תמלול מלא ומדויק של הטקסט המופיע בתמונה, מסודר לפי העמודות והכותרות:\n\n**בס\"ד**\n\n# מפתח ותוכן עניינים לפרשת בשלח\n\n### עמודה ימנית\n\n**רבינו בחיי**\n*   **הקדמה-כל האברים נמשכים אחר הלב,** והקב\"ה בוחן לבות בנ\"י במדת הבטחון להרגיל אותם במדה זו ................................................................................. **א'**\n*   **וכתב-כל מקריהם של ישראל במדבר היה נסיון גמור,** כדי שיגדלו נפשם השכלית במדרגות הבטחון שהוא שרש האמונה, ועי\"ז יהיו ראויים לקבל התורה, ולסבה זו קרע להם הים רק מדי עברם לתוכו ולא בבת אחת, וכן אחרי שרפו ידיהם מן התורה בא להם עונש עמלק נלחם בהם, דבעון ביטול תורה הצרות באות לעולם, וכל הענינים היו נסיון כדי לקבוע בנפשותם מדת הבטחון ....... **א'**\n*   **וילכו-כשבאו ישראל למרה,** היו המים מתוקים ונמררו, ועשה ה' זאת לנסותן, וכשהתפלל משה והשליך דבר מר במים וחזרו למתיקותם היה כל זה לחזק הניסיון ולקבוע בנפשם מדת הבטחון, וע\"כ רצה להמתיקם בדבר מר גם בתוך נס - התקינו שיהיו קורין בספר תורה שלשה ימים בשבוע, כדי שלא ילכו שלשה ימים בלא תורה ......................................................................................................... **ב'**\n*   **שם-שם לו חק ומשפט,** היינו שלמדם הקב\"ה חכמת וסגולת הצמחים, שיש עשבים שהם מחיים ויש שהם ממיתים ויש שמרפאים, ויש מהם מחליאים, וזה בין בטבע בין בסגולה ........................................................................................ **ב'**\n*   **ושם נסהו-אע\"פ** שכוחות הצמחים ידועים הם ויכולין להתרפאות מהם, עכ\"ז אין ראוי לתלות בטחונם בזה, ויתייאש מלהתפלל לה' עי\"ז ............................... **ב'**\n*   **ויצא העם-עיקר האמונה הוא להאמין במה שאין אדם רואה,** רק יתלה בטחונו בבעל הרחמים שבראו, שירחם עליו ויתן לו פרנסתו ........................................ **ב'**\n*   **למען-כל מי שמזונותיו רווחין הוא מחוייב לעסוק בתורה** - עיקר הנסיון מה שמנסה הקב\"ה את האדם הוא, כדי שעי\"ז יתפרסם לבריות אמונת התורה בעונש ושכר, ואין הנסיון .............................................................................................. **ב'**\n\n**של\"ה – דרך חיים תוכחת מוסר**\n*   **כי אמר-בזה שהקב\"ה עשה גדר ואמר פן ינחם העם וכו',** רואין, כמה צריך האדם לעשות לעצמו גדרים וסייגים ................................................................. **ג'**\n*   **ויקח שש-כשבא ח\"ו עת צרה או לא די רק להתפלל,** רק צריך לעשות תשובה בכל לב לה' ...................................................................................................... **ג'**\n\n**תורת משה – אלשי\"ך**\n*   **ויאמר ה'-פרנסה הוא הכל כפי הכנת המקבל,** כי עון ממית והזכות מטיב, וגם מי שעוסק בתורה צריך לידע שאם אין לו הרווחה עכשיו בעוה\"ז, שהוא כדאי, שעי\"ז יהי' לו פי שנים לעוה\"ב .......................................................................... **ג'**\n*   **או יאמר-כמו שהמן שהי' לחם רוחני נתן חיות לגוף גשמי,** כ\"כ יכול התורה הרוחני ליתן חיות להגוף הגשמי, ולכן יהי' להגוף קיום אחר התחי' כשלא יהי' שום מזון גשמי ................................................................................................... **ג'**\n*   **עוד יתכן-כשיצאנו ממצרים, רצה הקב\"ה לקדש נפשנו,** ושיהי' כל חשק של איש ישראל רק לעסוק בתורה, ולא יהי' היצר לאבן נגף, לכן ה' רוצה להשריש בנו הי\"ג עיקרים כשיצאנו ממצרים, והם מרומזים בפסוקים בפ' המן ............... **ה'**\n*   **ויאמר ה'-הקב\"ה אינו יכול להפיל שר של עמלק,** מפני שהוא ביד ישראל בכל חטא שחטא אדם הוא מחזיק אותו .................................................................... **ו'**\n*   **ויבן משה-אל יתייאש אדם לנצח היצה\"ר** מפני שנשבע הקב\"ה שלא יהי' השם שלם עד שינקום מעמלק, ובוודאי לא יניח הקב\"ה שמו נפרד ............................ **ו'**\n\n**אור המאיר**\n*   **בפסוק ותקח-כפי ההתעוררות של התחתונים,** ככה גורמים פעולות של הקב\"ה עליהם, ומרים פעלה בלקחה הת\"ף בידה, ר\"ת ה'צור ת'מים פ'עלו, ולמדה זאת שגם נשים אחרות לקחות, והי' לבם בטוח בחסדי ה' שיהפוך הדין לרחמים .... **ח'**\n\n---\n\n### עמודה שמאלית\n\n*   **הלצה-מי שיושב בעת שלש סעודות ואינו מדבר בשעה שאומרין דברי תורה,** וסובל לשמען אף שאינו מבינו, ובפרט אם צריך לסבול זמן מה להתעכב שם, יהי' ניצול עי\"ז מחבלי משיח, דלעתיד לבא יאמר מלך המשיח ג\"כ דברי תורה, ומי שסבל לשמוע מקודם, לא יהי' לו צער כ\"כ לשמוע דכבר רגיל הי' בזה .... **ח'**\n*   **בפסוק-אמירת פרשת המן בכל יום,** הוא סגולה רק אם אומרו בכוונה ובטחון שהפרנסה הוא רק מה', ולא יתלה בסיבות – כשרואה אדם שמזונותיו מצומצמין, העצה לזה להתחזק במדת הבטחון, וליתן צדקה גם ממיעוט שיש לו ............... **ח'**\n\n**ערבי נחל**\n*   **ויסר את אופן-המצריים רדפו אחר בני ישראל פנים מול פנים,** רק באמצע הגיע להם מורך מבני ישראל, ופגעו בישראל, ורצו ויעבורו את ישראל, וכדי שלא יגיעו ליבשה הי' צריך הקב\"ה להסיר את אופן מרכבותיו ........................ **י'**\n\n**נועם אלימלך**\n*   **או יאמר-אם הצדיק מלוה לאדם אזי הוא מקשר אתו,** אבל אם האדם שמלוה, הוא איש נעצב וריקן, הוא מכניס בו עצבותו ומפסיקו יותר מקדושתו ......... **יא'**\n*   **ויקח משה-האבות הק' ויוסף הצדיק הי' בהם בחינה,** שבכל דבר גשמי שהרגישו מתיקתו, היו חושבים שבודאי הבורא ב\"ה בעצמו, שברא הגשמי הזאת, הוא טוב ומתוק עד אין קץ - כשרוצה צדיק לעשות טובה לאיזה אדם, אז מקודם צריך שיכניס בהמקבל אמונה, שיאמין שיהי' לו טובה ע\"י צדיק הזה ............... **י\"ב**\n*   **ואתה הרם-א\"א לאדם שיקיים כל המצות בכל פרטיהם,** רק כשאדם מקיים מצוה אחת בשלימות, אזי יעזור לו ה' שיוכל עי\"ז לקיים כל המצות - דרך בני אדם כשאוחזים באיזה מדה והוא עומד בה במדרגה אחת, הוא סובר שכבר תיקן והוא שלם במדה זאת, ולא כן הוא אלא שצריך לעלות באותה מדה למדרגה גדולה הימנה ................................................................................................... **י\"ב**\n*   **כל המחלה-יציאת מצרים הוא יותר חידוש מבריאת שמים וארץ,** דהקב\"ה רוצה להיטיב, ממילא הבריאה הוא הטבה ואין זה נגד טבעו כביכול, אבל ביציאת מצרים שהכה המצריים במכות גדולות, וזה נגד טבעית, זהו חידוש גדול ...... **י\"ד**\n*   **ויאמר-כביכול הקב\"ה אומר שהפרנסה כבר היא מזומנת לאדם,** רק שממתין שיהי' לאדם בטחון, ואז פרנסתו מזומנת לו בלי שום צער ועבדות ................. **י\"ד**\n*   **והיה ביום-אם כל השבוע מתנהג אדם כראוי,** אזי ביום הששי נתלהב בקרבו קדושת שבת, ואף שלא עשה עדיין ההכנה ליום השבת, דהמעשה עצמו של ימי החול הם גורמים הקדושה, ומי שמרגיש הכנה עצמיות ביום השישי, סימן הוא לו שעסק בתורה כדבעי כל ימי החול ............................................................. **י\"ד**\n*   **ויאמר משה-אע\"פ שהאדם הוא מעורבב בדעת,** עכ\"ז עכ\"פ צריך להיות זכה וברורה באמונת ה' .......................................................................................... **י\"ד**\n*   **זכור את-צריך אדם ליזהר שלא יהיה ג' ימים בלא תורה ח\"ו** כי על ידי זה יתגבר היצר הרע ח\"ו במאוד, וצריך להתחזק מאד ולעסוק בתורה תמיד ..... **ט\"ו**\n\n**דגל מחנה אפרים**\n*   **או יאמר-בשיפוצו תורת הבעש\"ט חוצה אז יפקון מגלותא,** רמז בפסוק .. **ט\"ז**\n*   **או יאמר-בתורה יש מים מתוקים, וגם מים מרים,** וצריך האדם להתפלל בברכת והערב נא, שירגיש בתורה המים מתוקים ......................................... **ט\"ז**\n*   **ויאמרו-שלימות מדת הבטחון הוא, שיבטח בה' שיכול להזמין לו פרנסתו** גם בלי שום פעולה, וגם כשצריך לעשות איזה פעולה, אז הפעולה עצמו ג\"כ מה' ...... **ט\"ז**\n*   **או יאמר-כפי מה שמרחם אדם על הבריות,** כן מרחמין עליו מן השמים ... **ט\"ז**\n\n**אוהב ישראל**\n*   **דבר-צריך האדם להתיישב הדעת קודם לימוד התורה ותפלה,** לידע לפני מי הוא עומד, על דרך החסידים הראשונים שהיו שוהים שעה אחת קודם התפלה כדי שיכוונו לבם למקום ................................................................................. **ט\"ז**"
    },
    {
      "page": 2,
      "text": ""
    },
    {
      "page": 3,
      "text": "Here is the text extracted from the image, structured by column and section.\n\n### עמודה ימנית (Right Column) - המשך חת\"ם סופר\n\n**ויושע-ביום 'ההוא'** ר\"ת את השמים ואת הארץ, דתיכף מאז כשברא העולם, ה\"י ברצון השי\"ת להטיב לנו ולהושיענו ....................................................................**כ\"ו**\n\n**א\"י ויושע-התחלת אדם בעבודת ה'**, יכול להיות במי שלמד מאבות איזה אומנות, אבל אח\"כ צריך לילך ממדריגה למדריגה עד שמעצמו יבין וישכיל אמיתית מציאות ה', רק גם אחר שישיגו, צריך להיות לו ג\"כ אמונה...................**כ\"ו**\n\n#### באר מים חיים\n\n**וימרו בעומר-בפרנסה הראשונה** ששלח הקב\"ה לישראל, הי' רוצה להשריש בליבינו מדת הבטחון, ומפני זה לא העדיף המרבה והממעיט לא החסיר, כדי שילמוד האדם שאף שצריך לעשות השתדלות לפרנסה, עכ\"ז כל השתדלותו הוא הוא רק כמו זריעה בקרקע, דגם אם עומד שם כל היום וכל השנה, לא יצמח יותר, רק צריך לשים בטחונו בה'...........................................................................**כ\"ו**\n\n#### קדושת לוי\n\n**האור החיים-אף שרואין** שהים אינו סובל דבר מת, זה הוא מפני שהים לא נתקלקלה בחטא עץ הדעת דגרמה מיתה, רק הארץ, אבל ברשעים שהם מתים בחייהם, וכאן אצל המצריים נעשו על ידיהם קידוש ה' גדול לכן סבל אותם ולא רצה לפלטן..........................................................................................................**כ\"ו**\n\n**אז ישיר-כשיש לאדם** שמחה בלב אז נפסקת לשעה או יותר, אבל כשאדם מדבר דיבורים בעת שמחתו, אזי מתפעלת ונתרבה השמחה יותר ויותר, לכן בני ישראל כשנקרע להם הים רצו להרבות בשמחה, ע\"כ נכנסו בגדר דיבור לשיר השירה, בכדי להרבות תענוג................................................................................**כ\"ח**\n\n**או יאמר-עיקר שמחתינו** שהקב\"ה בחר לנו לעם, והעבודה שאנו עובדים את בוראינו היא עצמה תענוג גדול לנו........................................................................**כ\"ח**\n\n**במדרש-יכולים לומר** שני פנים מה שקפץ נחשון לתוך הים, או שמסר נפשו לה', והי' רוצה לקיום ציויו וגם אם יוטבע, או שהי' לו בטחון ב\"כ שבודאי יעשה ה' להם נס ולכן קפץ, והאמת הוא אופן השני שהי' בוטח בטחון שבודאי ינצלו, ומכח זה הבטחון דייקא נעשה להם הנס, ובזה הבחינה צריך אדם להתנהג תמיד שיהא בטוח בה' שבודאי יזמין לו ה' כל צרכיו, ועי\"ז ימלא ה' שיזמין לו......**ל'**\n\n**עזי וזמרת-הקב\"ה** יש תענוג ממעשינו, אע\"פ שהכל הוא בעזרתו ית', ע\"פ משל מהרה\"צ ר' בער זי\"ע, דכשאב מנסה בנו, אם הוא רואה שבנו אין עומד בשכלו מעצמו אז האב עוזר לו, ואפ\"ה יש נחת רוח לאב, אף שעזרו..................**ל'**\n\n**או יבואר-צריך האדם** לקבוע במחשבתו, שאצל הקב\"ה אין זה יגיעה לעשות הנס, רק העיקר בנס הוא להורות שהוא אוהב את ישראל, וצריך האדם להכיר שנס הוא בדרך הטבע, שה' יכול לשנות כל דבר...................................................**ל'**\n\n**ועלו-לעתיד כשהקב\"ה** יעשה לנו ניסים, אז יעשו האומות עמנו מלחמה ויצירו לנו, ובוודאי נדמה אז היצר הרע כהר דאם היה כחוט היו מניחים לנו לילך לארצינו, אבל באמת יהיה כחוט השערה, לזה ישפוט עמם ה'..........................**ל'**\n\n**אכלוהו-בששת ימי המעשה** השפע בא משמים לארץ ומשתלשל עד שמצמצם בעולם העשיה במעשה גשמיות, ולכן ירד המן בששת ימי חול, אבל בשבת הוא להיפוך נעשה מן הגשמיות רוחניות ועולה ממטה למעלה, ולכן גדל תבואה בשבת - אכלוהו היום, היינו אכילה הוא לשון תענוג, שעיקר התענוג יהיה היום, מיום השבת עצמו ולא מדבר גשמי......................................................................**ל\"א**\n\n**ויאמר ה'-ע\"י** שמצפה אדם בכל יום לשבת ומזכירו בכל יום, בזה הוא מראה שחביבה אצלו, ואז כשהגיע השבת ישמרנו כדת שלא לחללו ח\"ו, ומפני שאמר משה לישראל חשבת רק ביום ו', לכן נכשלו, שלא הי' להם הכנה...................**ל\"א**\n\n**הנני-הצדיקים נקראים** מהלכים, וזלת בתפלת י\"ח נקראים עמידה, כיון שצריך לצייר במחשבתו שהוא עומד לפניו ית', ומתחנן אליו כבן המתחטא לפני אביו, וכפי מה שאנו עושין למטה מעוררין למעלה, א\"כ כשאנו במדריגה של עמידה לפניו יתברך, אז גם כביכול הקב\"ה מחמת חיבת ישראל עומד לפנינו ומצמצם ומעמיד עצמו על נקודת ישראל שהם נקודת מחשבתו אשר בשבילם עלה ברצונו לברוא כל העולמות, והכל כדי להטיב לישראל והם עיקר המחשבה.............**ל\"א**\n\n#### חת\"ם סופר\n\n**ויצעקו-לפעמים מסתיר** הקב\"ה עצמו מישראל, כדי שיתפללו אליו, ומשה וגדולי ישראל הכינו זאת, רק דלת העם אמרו המבלי אין קברים, ומשה רבינו\n\n---\n\n### עמודה שמאלית (Left Column) - המשך חת\"ם סופר\n\nרצה להתפלל ועי\"ז יבא הישועה תיכף, לכן התפלל סתם, הושיענו ה', ואילו הי' מפרש שיחתו 'רבש\"ע בקע הים' הי' נבקע והי' קידוש ה', ולכן אמר לו ה' מה תצעק אלי................................................................................................................**ל\"ב**\n\n**זה אלי-אע\"פ דזירוזין** מקדימין עדיף מצצוה מן המובחר, אבל בקר\"ש שהוא קבלת עומ\"ש, מצוה מן המובחר עדיף, דליכא למיחש בזה לפיתוי היצר, לכן סמיכת גאולה לתפלה עדיף מלהקדימו בתחילת היום .....................................**ל\"ב**\n\n**ויהי בשלח-כשסר חוזק** הלב של פרעה, אז חכיר שכל כסף שקיבץ, הכל הי' בשביל בנ\"י, ושמח שפטרם, רק כשראה שסבב ה' את ישראל במדבר חשש שישובו לו, אז צוח וי, דלא חפץ בהם ובחמונם................................................**ל\"ג**\n\n**וחמושים-מן השמים** הזמינו שדתן ואבירם יהיו ניצים ועי\"ז יברח משה ממצרים ושם נתחכם להיות גואל ישראל, ולכן לא מתו הם בג' ימי אפילה, כדי שיראו גאולת ישראל ע\"י משה רבינו, ולבסוף נטלו את שלהם, וד' רבוא שמתו הי', מפני שהקב\"ה ניסה את ישראל בשתי נסיונות, א' דאף שיראו שונאיהם בג' ימי אפילה לא יגעו בהם, ומי שרצה לנגוע במצרי או בממונו מת, והנסיון הב' שיאמינו בשעת מכת בכורות דהצווחה היא מהמצריים, ולא לצאת מפתח ביתם.......**ל\"ג**\n\n**כי קרוב-כיון שמלו** ישראל קודם צאתם ממצרים, לכן חשש השי\"ת אם יארע להם מלחמה טרם עבור ג' ימים יפחדו, כי יזכרו מעשי שכם ביום השלישי, ע\"כ הניחם ה' דרך מדבר ולא ציוה לחזור לפי החירות עד אחר ג' ימים, ומשו\"ה נענש מרע\"ה בשרצה להביא בנו ערל למצרים ולמולו שם, דעי\"ז יבינו ישראל שיש סכנה למול ולילך בדרך, ועי\"ז גם הם לא יאבו לצאת ביום מילתם..................**ל\"ג**\n\n**ויקח משה-מפני כך** לא נתעסקו ישראל עם עצמות יוסף מפני שכל דור השביע לבניו שאחד ת' שנים יקחו עצמותיו, ולא ידעו שידלג ה' על הקץ, אך בני עמרם נצטוו מאביהם ליקח עצמות יוסף, דהוא ידע שנולד מושיען של ישראל - ועוד דמצות דבר נא קודמת לשבועת יוסף, רק דמצוה זו הי' רק מי שעבדו במצרים ולא שבט לוי...........................................................................................**ל\"ג**\n\n**ובני ישראל-ישראל** פחדו מהמצרים, מפני שלא הרגישו שפרעה רודף אחריהם, ומזליהו לא חזי, אבל באמת לא ראו זאת, מפני שהמצריים היו כמו מתים ולכן לא הרגישו...........................................................................................**ל\"ג**\n\n**ויאמרו-משה אמר** לישראל שישובו לפני פי החירות, ויעסקו בזה במצות קידוש ה', והמצוה יגן עליהם, רק חששו ישראל מה יהי' במדבר היכן יעסקו במצוה זו, וע\"ז השיב להם משה, שבזה שיקיימו מה שציוה להם הלאו של לא תוסיפו לראותם יהי' נחשב כאילו עשה מצוה, וזאת תגין עליהם.....................**ל\"ד**\n\n**מה תצעק-מרע\"ה** לא הי' רוצה להטריח כלפי מעלה, והיה ממתין לישועת ה' ממצרים שכבר הובטח, רק לא הי' יכול לסבול עוד תרעומת בני ישראל, ע\"כ התפלל שהקב\"ה ה' ילחם לכם היינו שימהר ישועתו כדי ואתם תחרישון, שהוא ינוח מסבלות ישראל ותרעומתן...........................................................................**ל\"ד**\n\n**ויאמינו-אף שנגזר** על ישראל עינוי ועבודה רבה מ\"מ נשפטו מצרים, דהם עשו יותר ממה שנגזר עליהם, נמצא דאפי' בשעת הסתר פנים והעלמת עין מהרשעים, מ\"מ השגיח השי\"ת בעין א' פקוחה ועין א' ישנה, כ\"ב בגלות הקב\"ה משגיח על כל פסיעה ופסיעה, אלא שיש להשי\"ת כח עצירת לשתוק ולסבול עד בוא יום אידם, ועל זה אמרו שירה מי כמוך באלים, באילמים שרואה ויודע ושותק..**ל\"ד**\n\n**אי נמי-כשיצאו** ישראל ממצרים הלכו לכל מקום אשר יסע הענן אפי' אל המדבר, והוא כשומע לכל מה שכתוב בתורה שבכתב, אבל אצל הים הלך הענן מאחריהם, ואם ילכו ישראל אחריו, הי' להם לשוב אל מצרים, רק מרע\"ה אמר היום לא תסעו אל מקום הענן, אלא יקפצו אל הים, ובזה וימרו על ים בי\"ם, דשמעו אל משה נגד השי\"ת, ומ\"מ נצח משה ונעשה להם נס, ושפטו מזה לשמוע אל החכמים אפי' לעבור על דברי תורה כשהשעה צריכה לכך.......................**ל\"ד**\n\n**מי כמוך-אחר כל הגדולה** כביכול אצל הקב\"ה שכל המלאכים עליונים רועדים מפניו, ומספרים תהלותיו, עכ\"ז השגיח ית\"ש בפגרי הרשעים להבליעם בארץ, לתת להם מקום קבר לשלם להם זכות שירה נאה שאמר ה' הצדיק, בזה יוצדק הדרש של מי כמוך באילמים ששומע ושותק עד יום מועד, מ"
    },
    {
      "page": 4,
      "text": "Here is the text extracted from the image, organized by column and entry. The text follows the order of the page numbers (Left Column: ל\"ה-ל\"ז, Right Column: ל\"ח-מ').\n\n### עמודה ימנית (במקור עמודה שמאלית - דפים ל\"ה-ל\"ז)\n\n**מפי מכמרע\"ה**, וזהו הענין של רדיפת שלום בין אדם לחבירו נעשו שקולין למשה, ולכן דברו במשה כיון דהיו שקולים .................................................................... **ל\"ה**\n\n**ויירהו ה'-**כפי הנראה יש כמה דברים נחשבים כסגולה ואין בטבע, כמו המאגנעט שמושך הברזל, וכדו', וכ\"כ יעודי התורה, אבל באמת אין סגולה בעולם אלא הכל בטבע, רק מה שנראה לנו כסגולה, הוא מפני חסרון ידיעתינו, ואילו יגלה לנו ה' סתרי הטבע הי' יכולין לידע ולהבין הכל, וזאת הראה ה' למשה בזה שעין מר הי' נתון המים למתוק, כ\"כ כל יעודי התורה הם בטבע ................. **ל\"ו**\n\n**כל המחלה-**במצרים הושמו המחלאות לנקמה, ולרוב הנקמה אמר אני ה' ולא השליח בעצמי אנקום ברשעי' הללו, משא\"כ מה שנאמרו בתורה בתוכחה הוא ע\"ד רפואה, וכמשל לאחד שהכה בן המלך, והמלך הלך לנקום לחתוך ידו בסייף, ובין כך ראה המלך נחש נושך ידו של בנו, והלך וקצץ נ\"כ בנו, וצווח הבן מה ביני לבין זה, והשיב לו, כי לזה המורד עשיתי סרדיוט, ולך לאהבתי אותך נעשיתי רופא שלך ........................................................................................................ **ל\"ו**\n\n**כי אני-**במצרים ה' מכה אחת עולה על גבי כולם, והוא הכבדת לב, שלא הי' יכול פרעה לשוב בתשובה, וזאת המחלה לא יביא הקב\"ה על ישראל לעולם, ואפי' יתחייבו ח\"ו מחלה מצרים ברכתי' בתוכחה, מ\"מ שערי תשובה לא ינעלו להם לעולם .................................................................................................................... **ל\"ו**\n\n**בשבתנו-**בני ישראל התרעמו דבמצרים נשכרו על רעבונם, דמצריים ישבו על סיר הבשר, וישראל לא אכלו ולא נהנו מהם, רק אכלו לחמם לשובע בהסתפקות, ואלו רצו להתערב עם המצריים היו יושבים שם ברומו של עולם, והיה להם שכר טוב על עמלם, משא\"כ במדבר שהם רעבים ללחם ולבשר, ואין לאל ידם להושיע לעצמם, וגם שכר טוב אין מגיע להם ........................................ **ל\"ו**\n\n**למען-**חמן ה' נסיון נפלא לב\"י, שאינו בנסיון העוני, ולא בנסיון העושר, שאע\"פ כשחטאו הי' יורד המן, והי' בזה ראי' שטוב עשו, כמו אחר שעשו העגל, וכן במרגלים וכדו', ואעפ\"כ ראינו שהאמינו אח\"כ במשרע\"ה, כמו בעגל שמעו לקול משה וחשקו המים, וכן ויעפילו שקבלו על עצמם מיתה, וזה הי' נסיון שאף שלא הלכו בתורתו, באותה שעה ממש הלכו .............................................. **ל\"ו**\n\n**והיה ביום-**מפני זה יצאו ישראל ללקוט המן בשבת, דבמדבר לא הי' שייך לנהוג כב\"ש, שלא הי' להם מזונם רק יום ביומו, רק בע\"ש אמר להם ה' שיזמינו לשבת כב\"ש, והם סברו כב\"ה ברוך ה' יום יום, לכן חשבו שמכאן ואילך יהי' להם לעולם עומר א' ליום ............................................................................................ **ל\"ו**\n\n**ובקר-**ישראל טעו והתרעמו, א', דהשי\"ת לא ציוה למשה להוציאם דוקא, והוא מעצמו עשה כן, ב', דאע\"פ שהשי\"ת צוה כן, מ\"מ אינו משגיח בפרטיות על השפלים, לכן אינו יודע מחסורם, לכן במה שהספיק מרע\"ה בשר ולחם ומים לס' רבוא מ' שנה, מזה יצא ספק לומר לכבוד עצמו עשה להשתרר על עם רב, כי מה לו צורך לממונם או לכבודם, וטענה שני, נתברר ע\"י שירד בבקר לחם, והוא להיות תביעת הלחם הי' כהוגן, משא\"כ תביעת הבשר, ונתברר שהקב\"ה השגיח על תלונתם שהוא תרעומות כל איש בביתו ובחדר משכבו, ומשגיח בשפלים, ואדרבא זהו כבודו וגדלו ............................................................................................ **ל\"ז**\n\n**ובקר-**על ידי השליו והמן הוסיפו ישראל השגה עליונה לחזות בנועם ה', וזכו לזה מפני שהיה תחלת שאלתם לשם שמים .............................................................. **ל\"ז**\n\n**בתת-**בהמן היו טעמים גם טעם בשר ושליו, ולא הי' שום יתרת בשליו, רק שראו בעיניהם שליו, והקב\"ה נתן להם הבשר בערב, ואף דהיו יכולי' להדליק נרות בערב, מ\"מ לא ניתן להם בעין יפה, לכן כמן כתי' אשר תאפו אפו, לצורך סעודת ליל שבת, והעודף הניחו למשמרת לסעודת שחרית, ולכאורה הא בלילה ליכא נר, ולמה להו לאפותו לבשל, הרי בלא\"ה טעמו בו טעם אפיה ובישול, רק מכאן רמז למצות נר שבת והוה כעין יממא, ויהנו מראייתו .................................... **ל\"ז**\n\n**ויאמרו-**שינוי הברכות הוא משינוי המאכלים, לכן כשראו ישראל המן דלא ישתנה בשום אופן לפ\"ז לא ישתנו הברכות, ואיך יברכו מאה ברכות בכל יום, אבל טעו דזה צריכין רק למאכלים והנאת העה\"ז שיש בו חלק לסטרא אחרא, אבל הכא הוא הלחם אשר נתן לכם ה' בעצמו לאכלה, ואין צורך למאה ברכות ............................................................................................................................ **ל\"ז**\n\n**עמר-**כמו במדת הגשמיות יש בכל אדם מדתו לפי אבריו וכל אדם משער באצבע שלו אמה שלו, כמו כן במדת הרוחניות כל אדם לפי השגתו, ש\"י עולמות לכל צדיק הוא כל א' לפי שיעורו, וכן הי' העמר במן, דכל א' כיוון בשיעור של עצמו, והשגתו הי' משיג ממנו מה שנקרא ברוחניות שיעור עמר ........................ **ל\"ז**\n\n---\n\n### עמודה שמאלית (במקור עמודה ימנית - דפים ל\"ח-מ')\n\n**ויוותרו-**מצינו בגמ' בשני אנשים דנרי שמן ביניהם בכל ערב שבת והוו מינצי אהדדי, לכן מסתמא הי' כן בדתן ואבירם שהיו בעלי ומריבה, וכיון דחמן בירור המשפט, לכן רצו לבררם בשבת ע\"י המן שנפל באותו היום, ע\"כ יצאו ללקוט בשבת, ואף שהי' להם מה שהותירו מערב שבת .................................................... **ל\"ח**\n\n**אכלוהו-**לכן יכול לירד גשמים בשבת דאין הרשויות חלוקות כלל, כיון דגשמים באים מגשמים, והם חלק מחלקי העה\"ז והכל חד, אבל המן שהי' רוחני לחם שמלאכי השרת אוכלי' והעה\"ז אינו כדי לו, ע\"כ לא הי' יכול לצאת בשבת חוץ למחיצתו, דהקב\"ה שומר שבת, עד לע\"ל שיתוקן העה\"ז ויהי' ראוי להרדת המן בכל מקום, אז לא יהי' זה חלוק מחיצה, וירד גם בשבת ........................................ **ל\"ח**\n\n**אכלוהו-**בכל יום הי' המן מבחינת קדושת אותו יום, ממילא שבת שהוא קדושת עוה\"ב לא ירד, דעוה\"ז אינו סובל קדושתו, אבל מרע\"ה אמר איש לפי אכלו, דילקטו כפי קדושת עצמו, וחשבו שירד גם בשבת, ואע\"ג שלאכילת גופם כבר ירד להם בשישי, עכ\"ז ירד להם קדושה יתירה רוחני', ורצו ללקוט בשבת, וא\"ל מרע\"ה היום לא תמצאוהו אותו זיו, רק בעוה\"ב תמצאוהו, אבל הרשעי' יצאו ללקוט, דרצו להשיג רק עוה\"ז, ולא ישאר חלקם לעוה\"ב, אבל טעו בזה, דחלקם נשאר לצדיקים לעה\"ב, שנוטל חלקו וחלק חברו בג\"ע ........................................ **ל\"ח**\n\n**היום-**אי ירד שבת מן היינו זיו העליון בלי גשם, ויהנו בעה\"ז מעין עה\"ב, אז הי' ירד בערב שבת לחם משנה מגושם, ובשבת ירד על ראשם זיו העליון, ולא נמצא זה בשדה כ\"א בדביקות נפשם באור העליון, ובאמת לא ירד בשבת, ורק בעוה\"ב תמצאוהו הרגשת נפשם שיתעדן מזיו העוה\"ב, אבל יו\"ט ויוה\"כ לא ימצאו בו זיו עוה\"ב ג\"כ, נמצא שבת מבורך ומקודש מכל זמן ................................................ **ל\"ח**\n\n**ויקראו-**המן הלבין עונותיהם של ישראל ונתכפרו עוונותיהם ע\"י, והשיגו בו סתרי תורה, ואף שהשיגו מחילת עוונות וגילוי רזי תורה ומדת עניוות, עדיין קראו לו מן, רק הכנת המזון ולא מזון עצמו, דבכל יום חשבו שיהי' הכנה למדרגה יותר מזה, להוסיף קדושה, עד בואם אל קצה ארץ כנען, דהיינו ביאת המשיח ועולם התיקון ................................................................................................................ **ל\"ח**\n\n**ובני-**בתחלה כשישראל אכלו המן הי' נקראי' בני ישראל קודם אכילה, והיו קדושים קודם המן, אבל זה היה רק מ' שנה עד שהתחילו לרבות ישוב בעולם בארץ נושבת, דכל שהעולם מוסיף ישוב, השכל מוסיף חורבן, ובאו למדרגה פחותה, את המן אכלו, בתחלה מן, והדר אכלו, שהוצרכו לעזר אלקי הנקרא מן טרם שאכלו, כי לא הי' להם משלהם, ואז פחתו פחת אחר פחת בעו\"ה, עד שבאו לקצה מעשה ארץ כנען ................................................................................................ **ל\"ח**\n\n#### חת\"ם סופר – תורת משה\n\n**ויהי-**יש ללמוד מהקב\"ה האיך נהג עם ישראל, כשיצאו ממצרים, דלא הי' לישראל אז שום טכסים אומה ולשון, ולא נהלם לאט בדרך ארץ עד שיהיו ראוים לחושבם עם ולהעלותם אח\"כ לקבלת התורה, דהי' גלוי לפני השי\"ת, דא\"א להבדיל עם ישראל מיתר העמים כ\"א בהפרידם מהם ומדרכם לגמרי, ע\"כ הפך הסדר וקרבנו להר סיני טרם למדנו דרכי עוה\"ז, ואח\"כ למדנו גם ארחות חיי עוה\"ז וזה וזה נתקיים בידינו, וכ\"כ צריכים אנו לגדל בנינו ללמדם תורה בתחלת גידולם, ואח\"כ עניני חיי עוה\"ז .................................................................................... **ל\"ט**\n\n**וחמושים-**מדרך המוסר איננו נכון שישראל בעצמם יעמדו נגד המצרים ללחום נגדם כיון שהם היו להם אכסניא, לכן צוה הקב\"ה שיבואו בנ\"י בתוך הים ביבשה ויבקעו המים ולא ילחמו בעצמם, ומשמיענו הקרא ענין דרך ארץ ........................ **מ'**\n\n**ויסב-**כשיצאו ישראל ממצרים, הי' רוצה הקב\"ה להראות להם שהם מושלים בעולם, ולא ידאגו על צרכי עוה\"ז, ע\"כ הסיבם דרך המדבר ולא הי' שום דבר שעמד בפניהם ................................................................................................................ **מ'**\n\n**התיצבו-**גם הקטני אמונה היו בעלי אמונה, רק כשראו שפרעה הקריב ונתעטפו גדולי ישראל בתפלה וצעקו אל ה', אז בא מורך בלבבם כי אמרו מה לכם לצעוק וכי ספק יש כעת, והלא ע\"מ כן חזרנו לאחורינו שיבואו מצרים וירדפו אחרינו ויתכבד ה' בפרעה וחילו, אע\"כ אתם מסופקים בדברי משה ולכן התרעמו, אבל באמת התפללו הצדיקים שתהי' ישועתם מה' בעצמו, ועי\"ז יהי' החירות מהם חירות עולם ............................................................................................ **מ'**\n\n**התיצבו-**לפעמים כשרצון ה' שישראל ילחמו בפני עצמן אז הקב\"ה עושה לכבודם שיראה כאילו הם לוחמים, אבל כשהקב\"ה בעצמו הוא הלוחם אין"
    },
    {
      "page": 5,
      "text": "Here is the text extracted from the image, organized by column and entry. The text follows the logical page order (Left Column: Pages 40-44, Right Column: Pages 44-46).\n\n### עמודה שמאלית (Left Column)\n\n1.  **[המשך]** כבודו יתברך לרדוף אחר פרעה או', ולכן מגביה מקום האומה, והוריד השר עם כל המרכבה טמאה שלו לעיני כל ישראל, כדי שידעו מה פעל אל........... **מ'**\n2.  **כי אשר-**ישראל האמינו בתחלה וישבו לפני פ' החירות על מנת שפרעה ירדפם וה' יעזרם, רק כיון דבמצרים בשעת מכת בכורות נתן להם הקב״ה מצות כדי שינצלו בזכות המצות האלו בשעת מפלת שונאים, לכן עתה כשקרב פרעה וחילו, ועדיין לא נצטוו בשום מצות לעסוק ובמה ינצלו, ע״כ צעקו, לכן א״ל מרע״ה שהוא מצוה להם לא תעשה של לא תוסיפו לראותם עוד עד עולם, ובזכות הרהור לא תעשה הלו ינצלו........................................................ **מ״א**\n3.  **כי אשר-**הקב״ה עשה הנס בים סוף, דרצה הקב״ה שיהיו לישראל מקום שיהיו יכולין לבוא שם בחזרה ולברך ולהודות שם על הנס, משא״כ במצרים שאסורים לחזור לשם ........................................................................................... **מ״א**\n4.  **מה תצעק-**אף שמדרך הצדיקים שיהי' נענים ברגע בתפלה, מ״מ אצל י״ס חפץ הקב״ה להמשיכם לים, מפני שהמצרים במים דנו את ישראל ובמים ידונו, וכ״כ שידעו ישראל כי לא מחכמתו של מרע״ה אלא מאת ה' היתה ואת שהי' הורע כח מזלו של משה במים, ע״כ נאמר מה תצעק אלי עתה פה דבר אל בנ״י ויסעו אל המים................................................................................................ **מ״א**\n5.  **מה תצעק-**אע״פ שאנחנו בטוחים בביאת המשיח והמתפלל הוא כמו חסרון אמונה, עכ״ז צריכין להתפלל שיחיש במהרה הישועה, ב״כ כשעמדו ישראל על הים, לא הי' יכול להיות התפלה שיושעו, דבודאי יהי' להם הישועה, רק דלא ידעו מה עליהם לעשות, ועי״ז היו צריכין להתפלל................................... **מ״א**\n6.  **ויאר-**מצינו בסנחריב שמתו כולם בליל פסח, שהיו שומעין קול שירה של מלאכים כשהיו אומרים שירה ועי״ז הי' מתים, וה״ה גם בפרעה הי' רוצים המלאכים לומר שירה כדי שימותו המצריים ע״י שמיעה זו, אבל הקב״ה משלם מדה נגד מדה, לפי שהמצריים השליכו בני ישראל במים לפיכך נשקעו המצריים במים, והי' רוצה להמית את המצריים במים מדה נגד מדה....................... **מ״ב**\n7.  **ויבקעו-**מפני כך לא נטלו ישראל את עצמות יוסף, מפני שהי' להם קבלה מאבותיהם להיות במצרים ת' שנה והם לא שמעו מהקב״ה בעצמו, ולצאת קודם הזמן הי' נגד קבלת אבותיהם, משא״כ משה ששמע מפי הקב״ה בעצמו הוא הי' יכול לעסוק בזה, ומזה מוכח שהיו ישראל מאמינים בקבלת אבותיהם....... **מ״ב**\n8.  **ויאמינו בה'-**באמת אין לומר שירה שמא ימעטו בשבחא דמרי, רק היות שבנ״י האמינו בנביאות משה רבינו שהורה להם לומר, לכן אמרו שירה ולא רק בדור ההוא רק בכל הדורות..................................................................... **מ״ב**\n9."
    },
    {
      "page": 6,
      "text": ""
    },
    {
      "page": 7,
      "text": ""
    },
    {
      "page": 8,
      "text": "Here is the OCR extraction of the text from the image, structured by columns and sections as they appear in the document.\n\n### **Column 1 (Right Side)**\n\n**ויאמר ה'-הוליך הקב\"ה** את ישראל במדבר ובלבלם במן, כדי להרגילם באמונה ובבטחון, דבמדבר שממה ידעו היטב שכל חריצות שבעולם לא יועיל להם להשיג מזונם, והיו מוכרחים לישא עיניהם להשי\"ת בתפלה שיזמין לחם פרנסתם, וענין המן נוהג גם עתה, וכמו שהמן ירד דרך נסיי מבלי עזר מפאת האדם, כן יורד גם עתה באופן פלא, אלא שא\"א לקבלו רק ע\"י אמונה שיאמין שאין השתדלות האדם עושה שום פעולה כלל בענין הפרנסה - הנסיין על בטחון הוא כשעוסקין בתורה ותפלה, דעיקר ביטול תורה ותפלה בא מדאגת מחר שאדם ירא ודואג שלא יהי' לו לאחר זמן - מי שאינו יודע לעסוק בתורה, יעסוק באמירת תהלים בכל יום וימשיך גם בזה את פרנסתו כמו בתורה .................... **ע\"ה**\n\n**והי' משנה-לשון 'היה'** מצינו אצל שלשה משפיעים, יוסף הצדיק, משה רבינו, מרדכי הצדיק, ושלשה אלו היו המשפיעים הראשים בישראל, יוסף השפיע פרנסה, משה גאולה מעבדות לחרות, ומרדכי השפיע חיים, כי הוציאם ממות לחיים, וזהו מרומז אצל לקיטת המן של שבת, לשון והיה לשון שמחה, ורומז לשלש השפעות, שעל ידי שנכבד את השבת כראוי, ישמח ד' את לבנו בשפעת חיים ומזוני, ונזכה לגאולה השלימה ........................................................................ **ע\"א**\n\n**איש אל-מה שנצטוו** ישראל שלא להותיר מן המן למחר, רק ללקוט בכל בוקר, זה הי' לנסות בטחונם שאינם דואגים דאגת מחר, וכשיעמדו בנסיון זה, יהי' חשוב לפני הקב\"ה כאילו הקטירו קטורת, והקריבו קרבנות ונסכים ............................ **ע\"א**\n\n**עוד טעם-צריך האדם** להתפלל תמיד על השגת מזונו, ואף לאחר שכבר השיג אותו, צריך ג\"כ לתפלה שיהי' לו המזון לבריאות ולא יזיקנו ח\"ו ........................ **ע\"א**\n\n#### **שם משמואל**\n\n**במד\"ר-מפני זה אצל הים,** קדמה תפילת ישראל לה' יותר מתפילת משה רבינו, מפני שתפלתם הי' מלב נשבר בתכלית, דמשה ידע שלא יהיו ישראל נאבדים, ולא הי' לו כל כך לב נשבר כשישראל שראו עצמם נאבדים לגמרי ................ **ע\"א**\n\n**אז ישיר-בשעה שאמרו** ישראל שירה על הים הי' בהם שכינה מדברת מתוך גרונם, ולא היו צריכים אפי' כלי הדיבור לזה, רק מפני שהכינו עצמם לזה מתייחסת גם עליהם השירה .................................................................................... **ע\"ב**\n\n**ויאמר ה'-ע\"י תמימות שהי'** בישראל שהלכו במדבר בארץ לא זרועה, נעשו בני ישראל דבוקים בה', וטומאתן שהי' להם פרחה, וכמו מקוה שמשיקין מים טמאין נעשו טהורין, ולישראל נחשב זה לחסד, לכן שורת הדין לעשות עמהם ג\"כ חסד ונבקע הים ................................................................................................ **ע\"ב**\n\n**ה' ילחם-בטחון הוא** למעלה מהאמונה, וע\"י הבטחון ממשיכים הישועה, ולכן אמר משה לישראל ואתם תחרישון דתהיו בטוחים בה', ויושעו ........................ **ע\"ב**\n\n#### **קרן לדוד**\n\n**ויהי-מה שהטביע הקב\"ה** את מצרים בתוך הים, היה מפאת אהבת ישראל, כמו אב שעושה נקם במי ששלח ידו בבנו, ורק מחמת אהבת בנו יגדל חרונו, ולא מחמת שיש איזה שנאה על האיש, דכיון דזמן שנשבעו הי' באשמורת הבוקר בזמן שהרחמים גוברים ע\"כ הוא מפאת אהבת ישראל .................................................. **ע\"ג**\n\n**ויאמר-עיקר האמונה** מתקיים רק על ידי שמירת תורה והמצות, וראי' לזה דבמצרים גם אחר שהאמינו חזרו מזה, ולא נתקיים אצלם האמונה, רק אחר קבלת התורה ............................................................................................................ **ע\"ד**\n\n#### **משך חכמה**\n\n**עזי וזמרת-אמונת ישראל** בתורה לא הי' ע\"י האותות, רק מפני שראו הנבואה, ולכן במצרים כל זמן שהי' להם אמונה מתוך מופתים הי' הביטול קל, ולכן בפ' התפילין קודם מ\"ת לא נאמר וקשרתם, דלא הי' הקשר נגלה עדיין .................... **ע\"ד**\n\n**עושה-כאשר נתוודע** דבר חדש אז יש בו התפעלות, ואח\"כ כשנתוודע חכמה יותר גדולה אז העבר אין בו פלא עכשיו, כ\"כ האותות שיעשה עמנו ה' לעתיד לבא, יהי' בלי דוגמה מנס של העבר ........................................................................ **ע\"ה**\n\n**ה' ימלוך-כל האדם** הוא אלקטרי אלקיי לעשות מה שחפץ רוצה, אבל אם הוא דבר המזיק אז לא יעשו האברים, וזה הוא העול שיקבלו ישראל לעתיד לבא, דכשיתנוצץ במוח של האדם לעשות איזה מצוה, תיכף יתעוררו האברים בלתי שום מפריע ................................................................................................................ **ע\"ה**\n\n---\n\n### **Column 2 (Left Side)**\n\n**ויקצוף-משה קצף** על ישראל כשהותירו מן המן, דעי\"ז הי' בטל מהם נסיון תמידי ללקוט דוקא לאותו יום, דראו בזה דבלאו הכי יתליעו, אבל הקב\"ה לא קצף, דיהי' נס גדול בזה שיראו שבשבת לא יתליעו, ולכן אין מניחין ג' לחמים כשחל יו\"ט אחר שבת, דלא חי נסיון בזה, ואין בזה שום הוראת נס ................ **ע\"ה**\n\n**למען-אל יחשוב** אדם דרק כשהוא כבר מורגל בתורה אז הוא מושגח מה' ואז אינו צריך לדאוג, אבל בלאו הכי צריך לדאוג על פרנסתו, דראינו שבנ\"י כשיצאו ממצרים היו ג\"כ בלי תורה ואעפ\"כ הוריד להם השי\"ת מן במדבר .................. **ע\"ה**\n\n#### **דברי ישראל**\n\n**עוד שם-זה שהאדם** צריך להיות רגיל לומר, 'גם זו לטובה' הוא רק כשאדם אומר זאת על עצמו, אבל על חבירו צריך לעזור בכל מה שיכול, והוא ע\"ד צחות ולא 'נחם' אלקים שלא נהג הקב\"ה אצל ישראל כמו נחום איש גם זו שהי' רגיל לומר גם זו לטובה .................................................................................................... **ע\"ה**\n\n**וחמשים-ישראל עלו** ממצרים בשמחה מפני שעלו ממ\"ט שערי טומאה, ולא מחמת שהי' להם כסף וזהב, ואותיות 'וחמשים', הוא 'ושמחים' ........................ **ע\"ו**\n\n**אז יאמר-הקב\"ה הי'** רוצה שיהי' לישראל הכסף בדרך שאלה, לרמוז בזה דאין מלווין לו לאדם לא כסף וזהב אלא תורה ומעשים טובים בלבד, וזאת רמז משה בשלקח עצמות יוסף, בשעה שעסקו ישראל בביזת מצרים .................................. **ע\"ו**\n\n**לא ימיש-עיקר התפלה** הוא ביום, ועסק התורה הוא בלילה, והעוסק בתורה ותפלה, הם משלימים זה לזה, דעד שלא ישקע התלהבות התפלה, עולה התלהבות התורה, וכן חוזר חלילה ולא תכבה ...................................................... **ע\"ו**\n\n**ובני ישראל-ובני ישראל** יוצאים ביד רמה, היינו 'בני ישראל וענן יוצא אז מהייטב אויף די האנד', ולא צריכין יותר ................................................................ **ע\"ו**\n\n**ופרעה-כשפרעה ראה** שאינו מועיל מה שעינה את ישראל, רצה להיות אוהב לישראל, וזה ופרעה הקריב, היינו קרבות ואהבה, אבל הקב\"ה לקח העמוד הענן ויבא בין מחנה מצרים ובין מחנה ישראל ולא קרב זה אל זה, שעשה פירוד ושנאה ביניהם שלא יהיה שום קרבות זה אל זה ................................................................ **ע\"ו**\n\n**וייראו-כשאדם הוא** טרוד, אז גם תפלה בלי כוונה הוא חשוב מאוד בעיני ה', והיינו תפשו אומנות אבותם, היינו שחטפו תפלתם בחפזון ובלי כוונה, ואעפ\"כ נתקבלה ברצון, דאין הקב\"ה בא בטרוניא עם בריותיו ........................................ **ע\"ז**\n\n**אז יאמר-הקב\"ה הי'** מתאוה לתפלה שבנ\"י צעקו במצרים 'אבא אבא', ולכן גירה פרעה שירדוף אחריהם ולא הי' להם מוחין להתפלל רק 'אבא אבא', והיינו תפשו אומנות 'אבותם', אז אמר הקב\"ה לכך הייתי מבקש לשמוע אותו הקול שכבר שמעתי במצרים ............................................................................................ **ע\"ז**\n\n**עוד-כשמשליך אדם** יהבו על ה', הוא פועל יותר מתפלה, ולכן אמר ה' למשה מה תצעק אלי, וכמו שבמצרים השליכו ישראל ילדיהן בשדות, וזה פעל בלי שום תפלה ............................................................................................................................ **ע\"ח**\n\n**וירא-כשאדם מאמין** שאין מקרה בעולם רק הכל בהשגחה פרטית מן השמים, ואפילו תנועה קלה ואפילו צעדי רגליו ספורים בהשגחה, אז ע\"י אמונה זו ניצול ממרה שחורה ועגמת נפש, אם אינו מתנהג כעניניו ברצונו ודעתו, ועיקר האמונה הוא ליזהר מלהרהר חלילה על שום דבר שהוא במקרה והזדמן ........................ **ע\"ח**\n\n**עוד אמר-מקוה הוא** סגולה לאמונה, ובמדינות שממעטין המקוה נתרבה אפיקורסות, ורמז \"ויאמינו בה\", בגי' 'מקוה' ........................................................ **ע\"ח**\n\n**אז יאמר-המן הי'** שורש הפרנסה, והעיקר לפרנסה הוא אמונה, ולבוא לידי אמונה הוא ע\"י כח התורה ........................................................................................ **ע\"ט**\n\n**אכלוהו-אם אוכלים** מאכלי שבת לשם קדושת שבת, הוא פועל כמו בחול ע\"י תעניתים וסגופים, וזה רק כשאינו אוכל לשם אכילה גסה – הרגשת שבת נתחלק, פשוטי עם מרגישים בשאומרים הפיוטים של שבת, חסידים, כשאומרים פסוקי דזמרה, וצדיקים העיקר בשעת אכילה .................................................................... **ע\"ט**\n\n**היום-רמז מוסר,** דיום שפנה מן האדם אין באפשרי למצוא עוד, וזה 'היום' לא תמצאוהו בשדה ............................................................................................................ **פ'**\n\n**קח צנצנת-עיקר** שורש הפרנסה הוא מכח התורה, לכן הניחו צנצנת א' לפני העדות, ומי שהוא דבוק בתורה אז כל ישראל מתפללין עליו, כמו שאומרים בקדיש דרבנן, על ישראל ועל רבנן ועל כל מאן דעסקין באורייתא וכו' יהא לכון חיים ארוכין ומזוני רויחי וכו' ........................................................................................ **פ'**"
    },
    {
      "page": 9,
      "text": "Here is the text extracted from the image, structured by column and section.\n\n### **Column 1 (Right)**\n\n**טוב לבב**\n\n*   **ויהי בשלח**-יש מדרשים חלוקים, דאמרו חז\"ל אין חבוש מתיר עצמו מבית האסורים, מזה נראה שעצה טובה לשלוח הגדול מחוץ לעיר, שלא יהא גם הוא חבוש, ואז יהא תפלתו עליהם יותר נשמעת, אבל מצינו ג\"כ שיפה תפלת החולה מתפלת אחרים עליו והיא קודמת להתקבל, ולפ\"ז יותר הגון שישאר המגין עם עמו ויהא גם הוא בצרה ותהי' תפלתו יותר מקובל, וזה הי' כוונת פרעה במה שלא השתעבד גם עם שבט לוי, דידע שהם בני עליה ומתפללים על צרתם של ישראל, וסבר שאם ישתעבד עמהם ויהיו גם כן בצרה עי\"ז יעשה תפלתם יותר רושם למעלה, שתפלת החולה יותר נשמעת, אבל כשראה שהשי\"ת הושיעם והוציא את בני ישראל ממצרים, אם כן ידע שטעה בדעתו, ויותר היה לו לשעבד גם את שבט לוי, ע\"כ התחרט על מה שלא שיעבד גם בהם......................... **פ\"ג**\n*   **ויהי בשלח**-כשמתחברים ישראל אל האומות אז יש להם שנאה עלינו, אבל אם מתרחקים מהם אין שנאתם גדולה כ\"כ, ולכן הסכים פרעה לשלח את העם דסבר דפשוטי עם יסיתו את ישראל לעבוד ע\"ז, אבל כשראה שגם הם נתעלו, אז רדף אחריהם, והיינו ויהפך לבב פרעה ועבדיו אל 'העם' ........................... **פ\"ג**\n\n**דברי יואל**\n\n*   **ויהי בשלח**-רוב בני אדם נשפעין מהנהגת המדינה, דשרים של מעלה הם המביאים לכל תאות יצה\"ר, ורצונם למשוך האדם אחר תאוות יצה\"ר, ובפרט לאיש הישראלי, לכן כיון שידעו ישראל שמעשיהם של האומות במקומות שהם נמצאים הם מקולקלים מכל האומות, וייראו ממלחמה של ל\"א מלכים שיתגברו עליהם כל שרי האומות להחטיאם, ע\"כ חשבו שטוב להם יותר לחזור למצרים, שהמצרים כבר ראו את היד הגדולה ונסו קרי\"ס שעשה השי\"ת בשביל ישראל, ושם יקל להם להתגבר מול תאוות האומות, דכבר נכנעו מפני כובד המכות וגם ראו התגלות הנסים שעשה ד' לאהבתו את ישראל, אבל רצון הבו\"ת הי' למנוע מחשבה זו מלבם, וכן הקיפם מ' שנה במדבר, שיהיו התורה נכללת בגופן, וע\"י התוה\"ק ישיגו דרך האמת ורצון הבורא, ולא יעלה על דעתם לשוב...............**פ\"ד**\n*   **באופן אחר**-תועלת וטובה גדולה נצמח לכל דורות ישראל, ממה שהקיפם הקב\"ה לישראל דרך המדבר, וזה הטעם מספיק שהוצרכו ישראל לסבב דרך המדבר, דאלמלי הלכו דרך ארץ פלשתים, הי' נשלל מהם הנסיון הגדול, ובזכות הנסיון הזה יתקיימו ישראל בגלותם ויבואו לעוה\"ב – פן ינחם העם בראותם מלחמה, היינו מלחמת היצר הרע שהוא שרו של עמלק, ועי\"ז ושבו מצרימה, יחזרו לבחי' מעשה ארץ מצרים, ע\"כ הכין הקב\"ה כח וזכות של דור המדבר להיות זכותן וכח קדושתם מגינא ומצלת לכל דורות ישראל, והסיבן דרך המדבר, ויהי' להם הזכות של לכתך אחרי במדבר - כל עוד שהאדם מצטער ומתחרט על המחשבה רעה, השי\"ת עוזרו ומצילו מידי מעשה, אבל אם ח\"ו ימצא מרגוע לנפשו ויקבל תנחומין על התהפכות המחשבה, אז עלול ח\"ו ליפול לתועבת מצרים................................................................................................ **פ\"ח**\n*   **באופן אחר**-גודל איסור שלא ליקח ממון מאנשים שאינם מהוגנים, וע\"י נעשים משוחד להם, וזה הי' נסיון של א\"א כשהשליכו נמרוד לכבשן האש, דהבע\"ד הסית אותו שאם ישתחוה פ\"א, יוכל אח\"כ להמשיך לבות כנ\"י לאמונה אבל אברהם לא רצה בזה, ויתור על הכל – בביזה גם אם נותנים דעת על זה יכולים לעשות משוחד, ושוחד שאני משאר עבירות, דגם מי שאוהב השוחד ויש לו אפי' רק דמיון לקבלו נעשה עי\"ז עצמו משוחד........................................ **פ\"ח**\n*   **באופן אחר**-אלמלי ה' גאולת מצרים גאולה שלימה, אז לא הי' מתחרט פרעה מה ששלח ישראל מארצו, שהי' משיג גודל התועלת שהגיע גם אליו מה שנתקדש על ידו ש\"ש, ורק מפני שלא הי' עדיין השלימות הגמור, לא באו האומות להשגה זו לראות האמת, ע\"כ צווח ווי על ששלח את ישראל מארצו - חי' למשה רבינו כח תפלה שהי' מכריח הגאולה כמו ר' חייא ובניו, ועד\"ז היה תפלת משרע\"ה כשעמרו ישראל על הים, ורצה לפעול בתפלתו שתהי' גאולה נצחיות, אבל לא הניחוהו מן השמים דלא הי' אז עדיין זמנו - אחד מסימני הגאולה הוא, כשיראו ישראל מטה משה רבינו ביד הגואל העתיד, הוא הגואל האמיתי, ולטעם זה אמר הקב\"ה למשה הרם את מטך ונטה את ידך, מחמת כח הגאולה שגננו בו עד שיבוא מלך המשיח, וע\"כ הי' נס קריעת ים סוף ע\"י נטיית ידו של משרע\"ה ולא באמצעות המטה, וצוהו הקב\"ה להרימו כלפי מעלה להורות שבחי' הגאולה הוא ביד הקב\"ה לבדו, עד שיעלה רצון העליון וימסרנה ביד מלך המשיח .............**צ'**\n\n---\n\n### **Column 2 (Left)**\n\n*   **או יאמר**-ע\"ד צחות משה רבינו אמר \"ראו\" כי ה' נתן לכם את השבת, מפני ששבת הוא זווג של ישראל, ואסור לאדם שיקדש את אשה עד שיראנה, שמא יראה בה דבר מגונה וכו', וע\"י שראו שהניחו המן מערב שבת עד הבוקר ולא הבאיש ורמה לא היתה בו, אז ראו שאין בו דבר מגונה...................................**פ'**\n\n**תורת אבות**\n\n*   **ואמר**-כשקועים בארציות אינם יכולם לדבר דברי תורה ותפלה, וזה נבוכים הם 'בארץ', אז סגר עליהם המדבר, היינו דיבורי תו\"ת...........................................**פ'**\n*   **זה אלי**-אם יהודי אומר 'זה אלי', אזי אומר הקב\"ה 'ואנוהו' אדור עמו, אבל אם אומר אלקי אבי, שאינו מתייגע להשיג כ\"א ממעשי אבותיו, ע\"ד מצות אנשים מלומדה, אומר הקב\"ה וארוממנהו הנני מתרומם עמו ....................................**פ'**\n*   **אמר**-היצה\"ר מכניס רצונו באדם, ומביא אותו לעצבות ומרה שחורה, אבל 'מים א בלאו פון התחזקות', יכולים לדחות כל העצות של היצר......................**פ'**\n*   **למען**-העיקר הניסיון שילכו עם ה' גם שהוא בבחי' 'לא', שאין לו מוחין, וזה למען אנסנו הילך בתורתי אם 'לא'......................................................................... **פ\"א**\n*   **אכלוהו**-צריכים להתענג מיום השבת עצמו, זיך אנעסן מיט'ן טאג, וזה אכלוהו היום............................................................................................................. **פ\"א**\n*   **ויהי ידיו**-אמונה צריך להיות למעלה מהרגשת הלב, ובשכר שיהודי משתמש באמונה יתירה, מאיר לו ה' את האמונה כשמש............................................. **פ\"א**\n\n**בית אברהם**\n\n*   **מה תצעק**-מרצון עד המעשה הוא מרחק גדול, וצריכים לבקש מה' להכניס הרצון בהמעשים............................................................................................ **פ\"א**\n*   **מה תצעק**-בצעקה לבד לה' אינם משיגים כלום, והוא כמו הכיכר שבוכה והוא נכנס אל הפח, רק צריכים להסיע מדרך הרעה ולנטות לדרך הטוב.............. **פ\"א**\n*   **מה תצעק**-הקב\"ה מוכן תמיד לעזור לאדם, אבל צריך האדם לעשות מה שמוטל עליו, ואז יוכל לצעוק לה'................................................................... **פ\"א**\n*   **ויאמר**-אצל הרה\"ק מוויטעפסק זי\"ע, הי' כל שבת אצלו כאילו לא מעולם לא הי' שבת, ולא תהי' עוד שבת אחרת - צריך לחום על כל רגע של שבת, דשבת אסורה בהסח הדעת, ק\"ו מתפילין שיש בהן אזכרות אסור בהיסח הדעת, שבת קודש שהיא שמא דקודשא ב\"ה על אחת כמה וכמה..................................... **פ\"א**\n\n**דברי שלום**\n\n*   **אז**-צריך האדם להתבונן קודם התפלה, ולא להיות רץ וחוטף התפלה, דתפלה רחמי הוא, וצריכין לערוך מקודם מחשבתו בישוב הדעת קודם התפילה, וזה אז יש"
    },
    {
      "page": 10,
      "text": ""
    },
    {
      "page": 11,
      "text": "Here is the text extracted from the image, structured by column and section headers. The text follows the logical page order (Left Column first [pages 104-110], then Right Column [pages 110-118]).\n\n### עמודה שמאלית (Left Column)\n\n**לחם המן** על פתח אהליהם, הי' יורד המן גם בשבת, לכן הציווי והי' ביום הששי נאמרה על תנאי, דמשרע\"ה הי' מצפה שלא יצטרך לצוות את ישראל בכך, דעדיין הי' תלוי בבחירתם אולי יזכו במעשיהם וירד לחם המן גם בשבת - החיוב על כ\"א מישראל אף אם עוסק במו\"מ או במלאכה, לקבוע עיתים לתורה, ואל ידמה בעיניו שבזה מחסר פרנסתו, רק צריך להאמין שנמשך השפעת פרנסה לעוסקי תורה מפ' המן, והנסיון במן הי' ג\"כ בעסק התורה בטענה מחיכן נתפרנס, אבל כיון שנמשך מירידת המן השפעת פרנסה לכל עוסקי תורה, נדחה טענת זו, והנסיון הזה קיים לכל הדורות הילך בתורתי, היינו לקבוע עיתים לתורה, ואף בדור שכח התורה בשפלות מאוד, מ\"מ אם הולכין בדרך התורה וקובעים עיתים לתורה כ\"א כפי יכולתו, נמשך לו השפעת פרנסה מהמן ........................ **ק\"ד**\n\n**ובוקר**-פרעה וחכמיו חשבו דלחבות עם רב בחנם, תהי' בגידה גדולה, לכן רצו לעשותה דרך חכמה, שלא ירגישו בזה, לכן לקח יועצים צדיקים, ועי\"ז יכלו לחפות על מעשיהם הרעים ולתרץ רשעתם, ויתרו השיג כוונתם וברח מהם, אבל איוב לא השיג זאת, ואולי הי' לו חשבון שמוטב יותר לישב עמהם ולהציל מה דאפשר, אבל עכ\"ז נחשב לו כל הרשעות שעשו המצריים כאילו הוא הי' עושה, ע\"י שישב ונתחבר להם וחיפה על מעשיהם, ועי\"ז נתן חיזוק לרשעים לעשות רשעתם, ואף שלפעמים מיחה קצת במחאה חלושה אין זה נחשב לכלום, דבלא\"ה לא היו דבריו נשמעים כלל, ועל זה הגיע לו עונש שנדון ביסורים - רק ע\"י שנמצאו איזה מישראל שהתחברו עם הערב רב, עי\"ז קבלו חיזוק ואומץ להסית את ישראל, ואותם שנתחברו אל הע\"ר הם היו הגורמים אל התלונה, וזולתם לא היו ביכולת הערב רב בעצמם להסית את ישראל - לכן לא זכה יתרו להיות במ\"ת מפני שהוא הי' גם באותו עצה מתחלה, וטרם שברח הי' להמצריים חיזוק ע\"י ישיבתו ביניהם, והוי לי' חלק קצת בשעבוד ישראל, ואף שברח ועשה תשובה מ\"מ לא הי' ראוי לשמוח בשמחתם - הערב רב לא עבדו את הים כלל, שהם לא האמינו בכח הנס שיעמוד הים כך עד שיעברו, והי' להם חשבון שיחזרו למצרים בלית ברירה, רק אחר שעלו ישראל מן הים באותו צד עצמו שירדו נתחברו עזה\"פ הע\"ר לישראל והלכו עמהם במדבר - חששו ישראל שהמצריים יעלו מן הים ע\"י התשובה שעושין, ולא מחמת חסרון אמונה ח\"ו אמרו כן, רק שבערך דור דיעה נחשב גם מחשבה זו למיעוט אמונה, דאחר שמרע\"ה צוה להם לילך אין להרהר, וע\"כ קראו אותם חז\"ל לקטני אמנה ........................ **ק\"ה**\n\n#### תורת אמת\n**ויאמינו**-אמונה הוא כשיש מסך המבדיל ואעפ\"כ הוא מאמין, וזה הי' במצרים כשראו ישראל שהמצריים הם מושלים בכיפה, ואעפ\"כ האמינו אז בה', אבל אח\"כ כשהודו מצריים בה' לא הי' ניכר הבדל ביניהם, לכן עשה ה' לפני ים סוף, שיתגברו עוד הפעם באמונה, ויהי' זה האמונה תקוע ביתד שלא תמוט ...... **ק\"ח**\n**קח צנצנת**-פרשת המן הוא לרמז לדורות, שבכל דבר שיהי' קשה על האדם, יתנהג כמו בקריעת ים סוף להיות להם אמונה ואזי יוושעו בכל, דבאמת הכל מוכן לאדם רק שחסר אמונה, ותיכף כשיאמין אז נתעורר השפע ................. **ק\"ח**\n\n#### מגן אברהם\n**א'ו**-השירה בים ע\"י משה רבינו וישראל הי' גם הכוונה בשביל ישראל בדורות הבאים, וזהו מה שאנו אומרים השירה בכל יום, ובפרט בשבת שירה, צריכים להתאמץ בתפלה שיכנסו ישראל לארץ, וע\"י תפלות ישראל מוסיפים כח כביכול בפמליא של מעלה ........................................................................ **ק\"ט**\n\n#### ייטב לב\n**בהקדם**-כשאדם רוצה להתפלל אז יאחז רעדה ובושה האיך להתפלל, אבל כשרואה שגם המלאכים אומרים קדושה, א\"כ אין סוף לעוונותיו ית', לכן האדם ג\"כ ראוי לומר ................................................................................. **ק\"י**\n\n---\n\n### עמודה ימנית (Right Column)\n\n**הוא הלחם**-העיקר באכילה הוא, שעי\"ז יהי' לו כח לעבוד ה', וזהו מה שהמן נשתנה טעמו, היינו טעם הרוחניות שבו הי' כפי כוונת האדם ........................ **ק\"י**\n**ויבא**-יעקב אבינו רמז במה ששם אפרים לפני מנשה, שלא יסורו מדברי חכמים, רק מחמת אריכת הימים במצרים נשכח מהם דבר זה, מפני כך הי' כח לעמלק לבא להלחם עם ישראל, מפני שרפו ידיהם מהגדרים וסייגים - עמלק נתן בלב ישראל לבטל טבילת עזרא, כי הטבילה מעורר טהרת הלב ........................ **ק\"י**\n\n#### ישמח ישראל\n**וישאו**-כשראו בנ\"י השר של מצרים הי' להם פחד, אבל משה אמר להם ששר של ישראל הוא ה' בעצמו, וכאשר ראו ישראל מה שהשיגו אז ע\"י אמונה אף במצב השפלות, אז אמרו שגם בגלות יכולים לזכות למדרגות גבוהות ....... **ק\"יא**\n**במד\"ר**-לזה משליכין להעופות מזונות בשבת שירה, כי במו שהעופות אין להם לחשוב איך מפרנסים, כ\"כ אנו צריכים לידע כי ה' הוא הזן אותנו ............ **ק\"יב**\n\n#### קדושת יום טוב\n**ה' ילחם**-ע\"י שאדם מתפלל מורה שיש לו אמונה, ממילא בא לו עי\"ז הישועה, ואין התפלה שינוי רצון רק בא לו הישועה בשכר האמונה - וע\"י שמירת שבת מורים ג\"כ האמונה, ואז יבא הישועה גם בלי תפלה ................................. **ק\"יג**\n\n#### ערוגת הבשם\n**עוד נראה לי**-כשאדם מודה לה' על העבר, אם אינו מקבל תוספת עבודה על העתיד אין זה נאות, וזה הי' שבח של ישראל יורדי הים שאמרו שבח על העבר, ובאותו פרק קבלו עליהם ג\"כ עבודה על העתיד ...................................... **ק\"יד**\n**ויאמר משה**-במצרים היו הדיבורים של ישראל בלי חיות, אבל כשיצאו ישראל ממצרים נשאם השי\"ת למדרגות גבוהות והרגישו ישראל חיות בהדיבורים, וזה הוא פי החירות, וכיון דתשובה צריך להיות באותו מקום ובאותו זמן וכו', נטל מהם הקב\"ה כח הדיבור ולא היו יכולים להוציא דיבורים זכים מפיהם, והתחילו לצעוק לה' בדיבור כזו, והקב\"ה שמע דיבורם וקרע להם הים, ובתפלה זו פעלו ישראל, שגם בתפלה כזו בימי הגלות יהיו נענים ............... **ק\"יד**\n**במדרש**-בכל הענינים צריך האדם להתיישב מקודם, אם יעשנו או לאו, ולא יהי' נבהל, אבל בעבירה צריך לברוח ממנה, וראי' ממה שראינו אצל יוסף הצדיק, וממנו למדו ישראל כשיצאו ממצרים, דהי' להם להתבונן מקודם באיזה דרך יצאו כדי שלא יהיו צריכים לנס, אבל כיון שהרגישו שאם יתמהמו שם ישתקעו ח\"ו בטומאה, לכן ברחו משם בחפזון ........................................ **ק\"טו**\n**אז ישיר**-צריך האדם לגדל בניו בתורה מקודם שמלמדים אותם חכמות חיצוניים, דהרושם שנחקק בתחילה בלב האדם קשה למחות מזכרונו, ומפני זה מקודם מתן תורה רצה השי\"ת שיקנו ישראל בנפשם עיקרים שבלעדם א\"א להתחיל בעבודת ה', והוא אמונה ובטחון - הודאה בדרך שיר הוא לרמז, דכמו אצל ניגון יש כמה מיני קולות ובהתחברותם נעשה ניגון יפה ונעים, לכן בזה שראו ישראל שכל השעבוד הי' להם לטובה .............................................. **ק\"טז**\n**ויבא עמלק**-היצר הרע כשרואה שאין יכול להפריע את האדם ע\"י גדלות, אז מנסה אותו ע\"י שיפיל את האדם לשפלות, דמעשיו אינם רצויים לה', אבל באמת צריך האדם להיות שמח בחלקו גם בעניני תורה ומצות, וגם המעט שחננו ה' הוא חסד ה' עליו, ולולי עזרתו לא הי' לנו אף כל דהו .................................... **ק\"יח**\n\n#### צבי לצדיק\n**א\"י**-מכיון שישראל היו נותנים עצמם למיתה כשקפצו לים, הראו בזה שכבר נתייאשו מן החיים, ונחשבו עי\"ז לבריאה חדשה, ובזה עצמם נשלם הזמן... **ק\"יח**"
    }
  ]
}