{
  "source_pdf": "C:\\Users\\Main\\yanky fridman\\בשלח_pages_4_to_14.pdf",
  "total_pages": 11,
  "pages": [
    {
      "page": 1,
      "text": "בס\"ד\nרבינו בחיי\nמפתח ותוכן ענינים לפרשת בשלח\nהלצה-מי שיושב בעת שלש סעודות ואינו מדבר בשעה שאומרין דברי תורה,\nוסובל לשמעו אף שאינו מבינו, ובפרט אם צריך לסבול זמן מה להתעכב שם,\nהקדמה-כל האברים נמשכים אחר הלב, והקב\"ה בוחן לבות בנ\"י במדת יהי' ניצול עי\"ז מחבלי משיח, דלעתיד לבא יאמר מלך המשיח ג\"כ דברי תורה,\nהבטחון להרגיל אותם במדה זו.....\nא' ומי שסבל לשמוע מקודם, לא יהי' לו צער כ\"כ לשמוע דכבר רגיל הי' בזה.... ח'\nוכתב-כל מקריהם של ישראל במדבר היה נסיון גמור, כדי שיגדלו נפשם בפסוק-אמירת פרשת המן בכל יום, הוא סגולה רק אם אומרו בכוונה ובטחון\nהשכלית במדרגות הבטחון שהוא שרש האמונה, ועי\"ז יהיו ראוים לקבל התורה, שהפרנסה הוא רק מה', ולא יתלה בסיבות - כשרואה אדם שמזונותיו מצומצמין,\nולסבה זו קרע להם הים רק מדי עברם לתוכו ולא בבת אחת, וכן אחרי שרפו העצה לזה להתחזק במדת הבטחון, וליתן צדקה גם ממיעוט שיש לו..............ח'\nידיהם מן התורה בא להם עונש שעמלק נלחם בהם, דבעון בטול תורה הצרות\nבאות לעולם, וכל הענינים היו נסיון כדי לקבוע בנפשותם מדת הבטחון ....... א'\nערבי נחל\nוילכו-כשבאו ישראל למרה, היו המים מתוקים ונמררו, ועשה ה' זאת לנסיון, ויסר את אופן-המצריים רדפו אחר בני ישראל פנים מול פנים, רק באמצע\nוכשהתפלל משה והשליך דבר מר במים וחזרו למתיקותם היה כל זה לחזק הנסיון הגיע להם מורך מבני ישראל, ופגעו בישראל, ורצו ויעבורו את ישראל, וכדי\nולקבוע בנפשם מדת הבטחון, וע\"כ רצה להמתיקם בדבר מר נס בתוך נס שלא יגיעו ליבשה הי' צריך הקב\"ה להסיר את אופן מרכבותיו.\nהתקינו שיהיו קורין בספר תורה שלשה ימים בשבוע, כדי שלא ילכו שלשה ימים\nבלא תורה.\n......\nב'\nנועם אלימלך\nשם-שם לו חק ומשפט, היינו שלמדם הקב\"ה חכמת וסגולת הצמחים, שיש או יאמר-אם הצדיק מלוה לאדם אזי הוא מקשר אתו, אבל אם האדם שמלוה,\nעשבים שהם מחיים ויש שהם ממיתים ויש שמרפאים, ויש מהם מחליאים, וזה הוא איש נעצב וריקן, הוא מכניס בו עצבותו ומפסיקו יותר מקדושתו........ י\"א\nבין בטבע בין בסגולה...........\nויקח משה-האבות הק' ויוסף הצדיק הי' בהם בחינה, שבכל דבר גשמי\nושם נסהו-אע\"פ שכוחות הצמחים ידועים הם ויכולין להתרפאות מהם, עכ\"ז שהרגישו מתיקתו, היו חושבים שבודאי הבורא ב\"ה בעצמו, שברא הגשמי הזאת,\nאין ראוי לתלות בטחונם בזה, ויתייאש מלהתפלל לה' עי\"ז.\nהוא טוב ומתוק עד אין קץ - כשרוצה צדיק לעשות טובה לאיזה אדם, אז מקודם\nויצא העם-עיקר האמונה הוא להאמין במה שאין אדם רואה, רק יתלה בטחונו צריך שיכניס בהמקבל אמונה, שיאמין שיהי' לו טובה ע\"י צדיק הזה.............י\"ב\nבבעל הרחמים שבראו, שירחם עליו ויתן לו פרנסתו..\nואתה הרם-א\"א לאדם שיקיים כל המצות בכל פרטיהם, רק כשאדם מקיים\nלמען-כל מי שמזונותיו רווחין הוא מחוייב לעסוק בתורה - עיקר הנסיון מה מצוה אחת בשלימות, אזי יעזור לו ה' שיוכל עי\"ז לקיים כל המצות - דרך בני\nשמנסה הקב\"ה את האדם הוא, כדי שעי\"ז יתפרסם לבריות אמונת התורה בעונש אדם כשאוחזים באיזה מדה והוא עומד בה במדרגה אחת, הוא סובר שכבר תיקן\nושכר, ואין הנסיון.........\nוהוא שלם במדה זאת, ולא כן הוא אלא שצריך לעלות באותה מדה למדרגה\nגדולה הימנה...\nכל המחלה-יציאת מצרים הוא יותר חידוש מבריאת שמים וארץ, דהקב\"ה\nשל\"ה - דרך חיים תוכחת מוסר\n......\nי\"ב\nרוצה להטיב, ממילא הבריאה הוא הטבה ואין זה נגד טבעו כביכול, אבל ביציאת כי אמר בזה שהקב\"ה עשה גדר ואמר פן ינחם העם וכו', רואין, כמה צריך מצרים שהכה המצריים במכות גדולות, וזה נגד טבעית, זהו חידוש גדול......י\"ד\n.......\nהאדם לעשות לעצמו גדרים וסייגים.\nויקח שש-כשבא ח\"ו עת צרה אז לא די רק להתפלל, רק צריך לעשות תשובה\nבכל לב לה'\nתורת משה – אלשי\"ך\nג'\nויאמר-כביכול הקב\"ה אומר שהפרנסה כבר היא מזומנת לאדם, רק שממתין\nשיהי' לאדם בטחון, ואז פרנסתו מזומנת לו בלי שום צער ועבדות.................\"\nוהיה ביום-אם כל השבוע מתנהג אדם כראוי, אזי ביום הששי נתלהב בקרבו\nקדושת שבת, ואף שלא עשה עדיין ההכנה ליום השבת, דהמעשה עצמו של ימי\nהחול הם גורמים הקדושה, ומי שמרגיש הכנה עצמיות ביום השישי, סימן הוא\nוברורה באמונת ה'.\nי\"ד\nויאמר ה'-פרנסה הוא הכל כפי הכנת המקבל, כי עון ממית והזכות מטיב, לו שעסק בתורה כדבעי כל ימי החול.\nוגם מי שעוסק בתורה צריך לידע שאם אין לו הרוחה עכשיו בעוה\"ז, שהוא כדאי, ויאמר משה-אע\"פ שהאדם הוא מעורבב בדעת, עכ\"ז עכ\"פ צריך להיות זכה\nשעי\"ז יהי' לו פי שנים לעוה\"ב.\nאו יאמר-כמו שהמן שהי' לחם רוחני נתן חיות לגוף גשמי, כ\"כ יכול התורה זכור את-צריך אדם ליזהר שלא יהיה ג' ימים בלא תורה ח\"ו כי על ידי זה\nהרוחני ליתן חיות להגוף הגשמי, ולכן יהי' להגוף קיום אחר התחי' כשלא יהי' יתגבר היצר הרע ח\"ו במאוד, וצריך להתחזק מאד ולעסוק בתורה תמיד..\nדגל מחנה אפרים\nג'\nט\"ו\nשום מזון גשמי.\nעוד יתכן כשיצאנו ממצרים, רצה הקב\"ה לקדש נפשנו, ושיהי' כל חשק של\nאיש ישראל רק לעסוק בתורה, ולא יהי' היצר לאבן נגף, לכן הי' רוצה להשריש או יאמר-כשיפוצו תורת הבעש\"ט חוצה אז יפקון מגלותא, רמז בפסוק .. ט\"ו\nבנו הי\"ג עקרים כשיצאנו ממצרים, והם מרומזים בפסוקים בפ'................ או יאמר-בתורה יש מים מתוקים, וגם מים מרים, וצריך האדם להתפלל\nויאמר ה'-הקב\"ה אינו יכול להפיל שר של עמלק, מפני שהוא ביד ישראל בכל בברכת והערב נא, שירגיש בתורה המים מתוקים\nחטא שחטא אדם הוא מחזיק אותו\nט\"ו\nויאמרו-שלימות מדת הבטחון הוא, שיבטח בה' שיכול להזמין לו פרנסתו גם בלי\nויבן משה-אל יתייאש אדם לנצח היצה\"ר מפני שנשבע הקב\"ה שלא יהי' השם שום פעולה, וגם כשצריך לעשות איזה פעולה, אז הפעולה עצמו ג\"כ מה'...... ט\"ז\nשלם עד שינקום מעמלק, ובוודאי לא יניח הקב\"ה שמו נפרד.\nאו יאמר-כפי מה שמרחם אדם על הבריות, כן מרחמין עליו מן השמים... ט\"ז\nאור המאיר\n........................\nאוהב ישראל\nבפסוק ותקח-כפי ההתעוררת של תחתונים, ככה גורמים פעולות של הקב\"ה דבר-צריך האדם להתיישב הדעת קודם לימוד התורה ותפלה, לידע לפני מי\nעליהם, ומרים פעלה בלקחה הת\"ף בידה, ר\"ת ה'צור ת'מים פ'עלו, ולמדה זאת הוא עומד, על דרך החסידים הראשונים שהיו שוהים שעה אחת קודם התפלה\nשגם נשים אחריה לקחוה, והי' לבם בטוח בחסדי ה' שיהפוך הדין לרחמים .... ח' כדי שיכוונו לכם למקום.\nט\"ז\n"
    },
    {
      "page": 2,
      "text": "אמר הוא-המן יורד גם עכשיו רק שהוא מלובש בלבושים, ובכל אחד בהסיבה\nלפרנסתו מלובש שם המן....\nכ\"א\nופרעה הקריב-כיון שהיו ישראל בעת קריעת ים סוף בצרה גדולה, הי' להם\nהעצה להנצל רק ע\"י מסירת נפשם לה', ובני ישראל שיערו בעצמם שאינם\nבמדריגה זו, אבל משה רבינו אותם התיצבו וראו, שיבואו למדריגה זו, וכן הי'\nשקפץ נחשון בן עמינדב.\nט\"ז\nאורח לחיים\nויהי-לא יאמר אדם שא\"א לעמוד נגד יצה\"ר ולכבוש הר הגדול, דבודאי אין\nנותנין לו יצה\"ר גדול שלא יוכל לכבשו,וכשבא לטהר וללחום עם יצה\"ר השי\"ת\nיהי' בעוזרו\nכ\"א\nהנני ממטיר-אם אדם רוצה לידע איך להתנהג בכל יום, יוכל לידע זה, ע\"י\nשיסתכל בתורה שלמד בה, ויכל לידע כל דברים העתידים וכל הבא עליו.....י\"ז\nמאור ושמש\nוירא-במצרים סברו ישראל דהם נגאלים רק בזכות אבותם ולא מפני שה' אוהב\nאותם, אבל כשראו ישראל שהים פלט המצריים, והסיבה לזה כדי שלא ילכו\nבפחד שהמצריים רודפים אחריהם, אז הבינו גודל אהבת ה' אליהם, והכירו שגם\nבמצרים הי' להם אהבה, ע\"פ משל נאה.\nכ\"ב\nויהי בשלח-צריכים ליזהר מלקרב כל אדם, דכמה פעמים יש אנשים צבועים\nשמראים עצמם שהם כשירים, ואין תוכם כברם, וע\"י שמחברים עמהם, הם\nמבלבלים העובדי ה', מעבדות השם, ולכן סבב הקב\"ה את ישראל במדבר שעי\"ז\nיתפרדו הערב רב מישראל.\nותקח-הנשים לא היו יכולין לענות ולשיר אחר משה השירה, כי קול באשה\nערוה, לכן לקח מרים וכל הנשים התוף בידיהן, וע\"י שהוכו על התוף לא שמעו\nישראל השיר שלהן\nכ\"ב\nויהי-מחוייבים להזדרז מלחמה נגד הערב רב, וכל זמן שיש מהם בעולם הם\nמעכבים הגאולה רח\"ל, ולכן לא נחם אלקים דרך פלשתים, דאם הוליכם משם\nהיו מתגברין כ\"כ עד שלא הי' אפשר לישראל שיחזרו בתשובה.....\nר\"ץ\nי\"ח\nתפארת יהונתן\nוה' הולך-לא יחזיק אדם טובה לעצמו במצוה שעשה, וכן כשעושה ח\"ו עבירה\nלא יהי' קל בעיניו, ועי\"ז יוסיף אומץ לעבוד ה'......\nי\"ח\nעוד נראה-אצל הים היה זוכה כל אחד מישראל, שיהיה השכינה מדבר מתוך\nגרונו השירה, רק הערב רב לא היה זוכים לזה, לכן כתיב אז ישיר משה ובני\nישראל בדוגמתו, שקיבלו השירה ברוח הקודש, ואמרו לערב רב לאמר אחריהם\nמה שישמעו מפיהם\nכ\"ג\nוישאו-מי שמקבל על עצמו מסירת נפש, אזי אינו צריך לבוא לידי נסיון, לכן\nכשבא איזה צער לאדם אומרים שמע ישראל, דאנו מוכנים למסירת נפש, ממילא\nאין צריך עוד לנסיון, דכבר הוא דבוק באלקים חיים.\nונראה-הנשים לקחו תופים בידם כשאמרו שירה אבל לא אנשים, כי האנשים\nהיה תיכף שורה עליהם רוח הקודש ולא היו צריכים התעוררת שמחה ע\"י כלי\nשיר, משא\"כ הנשים היו צריכים להתעוררת שמחה תחילה ע\"י כלי שיר ..... כ\"ג\nויאמר- מי שרוצה לקבל עליו עול תורה, צריך להיות לו בטחון בה' שלא לרדוף\nאחר פרנסתו, ועקימת שפתיו של תורה הוי מעשה לקיים וברכתיך בכל אשר\nתעשה, וכל מי שעוסק יותר בדביקות בה', אז פרנסתו מצוי' יותר בריוח .... י\"ט\nגם יש-הנשים לקחו תופים בידם ולא האנשים, דכיון דקול באשה ערוה, והם\nהיה שוררים ומחנגים, ולכן שלא להכשיל אנשים בקולם לקחו תופים בידם לבל\nישמע קולם.\nמנחם ציון\nכ\"ג\nהנה כל-הטעם שלא ירד המן בשבת הוא, כדי שלא יבאו ישראל לחשש טלטול\nשלא לצורך, אם יטלו יותר מהצורך להם, וגם באנשים הכשירים הי' חשש זה,\nדשמא בעת לקיטתם יהי' להם חשש שאין להם עומר שלם, וילקטו יותר..... י\"ט\nוידי-מלחמת עמלק הוא קשה מאוד מפני שהוא רוצה לעקור האמונה, ולכן הי'\nמלחמה זה קשה ביותר למשה רבינו והי' צריך לעשות פעולות רבות................ ה' ילחם-בזה שבנ\"י היו נרדפים קודם שנכנסו לים, הי' בזה לימוד לדורות,\nשאע\"פ שיהיו ישראל בגלות נרדפים, לא יכלו הגוים להתקרב עליהם כל הלילה\nשל הגלות...\nכ\"ג\nאור לשמים\nמאור עינים\n\".........\nויחזק ה'-כשמאמין אדם שבכל מקום יש ניצוץ הק', אזי לא יתיירא משום דבר,\nואפי' מיצה\"ר, דאם השי\"ת שוכן בקרבו, בודאי לא ישמע אל .................\nעוד נ\"ל-מצות קריאת שמע מגין גם אם לא שמע לאזנו, כי גדול אמונתו הגם כל המחלה-ע\"ד הלצה, הרופאים אומרים להחולה אתה בעצמך גרמת לך כי\nשהוא לא שמע, שהולך למקום גבוה למעלה מהשמיעה, והקב\"ה מקבלו........כי אכלת דבר פלוני, וכ\"כ היסורים של אדם הוא בעצמו גרם לו בעונותיו, רק\nהשי\"ת ברוב רחמנותו רופא אותו, ואינו אומר לו אתה גרמת לך....\nאהבת שלום\nקח צנצנת-כהיום יש ג\"כ קריעת ים סוף, ואח\"כ בא המן, וכשאדם אומר\nויאמר ה'-גודל חסד ה', שנחשב ליראי השם כמו תפלה גם ספורי דברים שירה בכל יום, צריך לצייר בדעתו כאילו אומר שירה על הים, ונעשה באמת\nבעלמא, מפני שגנוזים בתוכם דברי תחנונים, כגון אמירת משה רבינו התיצבו למעלה בחי' קריעת ים סוף.\nוראו וכו' ה' ילחם לכם, שהכתוב חושבו לתפלה.\nבפסוק והיה-ע\"כ אומרים בכל ערב שבת מזמור ק\"ז, שמרומז שם תעו\nובני-הבטחון של ישראל אצל הים הי' כ\"כ גדולה, שהלכו בים באמונה, כמו במדבר, היינו הדיבור של כל ימי השבוע, ויצעקו צריך לצעוק אל ה', צעקה בלי\nשהיו הולכים על היבשה, ובטחונם הי' בעיניהם כמזומן אצלם..................\"אם דיבור לתקנו - בכל דבר הנראה חול יעשנו על טהרת הקודש, היינו כמו באכילה\nעזי וזמרת-מי שהי' בצרה וניצול הוא מרגיש יותר הישועה, ממי שלא הי' ובמשא ומתן יש בו כמה דינים והלכות, והם החיות של הדברים - אל ימעט\nבעיניו של אדם שום דיבור הגון, כי אין כל העולם יכול לקבל אור השכר של\nבצרה מעולם, ויש בכח שכלו לומר שירות ותשבחות להק\"..................\" מצוה ודבור הגון .......\nאמרי פנחס\nכ\"א\nכ\"א\nזרע קודש\n..כ\"ד\nכ\"ד\nכ\"ה....\nלכך לא-לכן לא ירד המן פעם אחת בשבוע, רק בכל יום כדי שיתחזקו וישובו-עבודה זרה של מצרים הי', פי החירות, שמדבר כל מה שרוצה, והקב\"ה\nבאמונתם שבודאי ירד מן בכל יום......\nאמר וישובו ויחנו לפני פי החירות, שישובו אל ה' ושלא ידברו רק מה שצריך\nלמה-דבר שנפרד משרשו, אם הוא עכ\"פ קרוב לשרשו יכול להתקיים איזה זמן, לעבודת ה'.....\nכאילן שנעקר מהקרקע אם עכ\"פ מונח על הקרקע יכול להתקיים איזה זמן, לכן ויאמר ה'-כמה פעמים משיב הצדיק לאדם בהעברה בעלמא, אבל באמת\nהמן שהי' שרשו מאד למעלה, היה מתקלקל בלינה, אבל זה הי' רק בחול, אבל הדיבור בעצמו הוא תפלה, ופועל בזה הדיבור, רק צריך להסתירו כדי שלא\nבשבת שהקדושה באה למטה ונתקרב אז אל השורש, לכן לא הבאיש......... כ\"א ירגישו המקטריגים.\nאמר-אף כשירד המן בחוש היה חילוק גדול בין מי שהי' לו אמונה, ובין מי שלא ויאמר-עיקר אחיזת או\"ה בישראל הם ע\"י מדותיהם, דכל אומה יש לו טבע\nהי' לו כ\"כ, ולכן עכשיו כשאומרים פרשת המן ומובטח לו שלא יחסר לו מזוני, ומדה רע, וכ\"ז שבני ישראל אין שוברין מדותים יש להם אחיזה, וכשבנ\"י שוברין\nהעיקר צריך לצרף לזה האמונה, דעיקר אמירת פ' המן הוא אמונה......... כ\"א מדותיהם, אזי כל כוחות האומות נשברין, רק צריך לזה עזר .................\"\n..כ\"ה"
    },
    {
      "page": 3,
      "text": "ויושע-ביום ההוא' ר\"ת את השמים ואת הארץ, דתיכף מאז כשברא העולם, רצה להתפלל ועי\"ז יבא הישועה תיכף, לכן התפלל סתם, הושיעינו ה', ואילו הי'\nהי' ברצון השי\"ת להטיב לנו ולהושיענו.\nמפרש שיחתו 'רבש\"ע בקע הים' הי' נבקע והי' קידוש ה', ולכן אמר לו ה' מה\nא\"י ויושע-התחלת אדם בעבודת ה', יכול להיות כמי שלמד מאבות איזה תצעק אלי.\nכ\"ו...\nאומנות, אבל אח\"כ צריך לילך ממדריגה למדריגה עד שמעצמו יבין וישכיל זה אלי-אע\"פ דזריזין מקדימין עדיף ממצוה מן המובחר, אבל בקרי\"ש שהוא\nאמיתית מציאות ה', רק גם אחר שישיגו, צריך להיות לו ג\"כ אמונה.............כ\"ו קבלת עומ\"ש, מצוה מן המובחר עדיף, דליכא למיחש בזה לפיתוי היצר, לכן\nסמיכת גאולה לתפלה עדיף מלהקדימו בתחילת היום.\nל\"ב\nבאר מים חיים\nויהי בשלח-כשסר חוזק הלב של פרעה, אז הכיר שכל כסף שקיבץ, הכל הי'\nוימדו בעומר-בפרנסה הראשונה ששלח הקב\"ה לישראל, הי' רוצה להשריש בשביל בנ\"י, ושמח שפטרם, רק כשראה שסבב ה' את ישראל במדבר חשש\nבליבינו מדת הבטחון, ומפני זה לא העדיף המרבה והממעיט לא החסיר, כדי שישובו לו, אז צוח וי, דלא חפץ בהם ובהמונם.\nשילמוד האדם שאף שצריך לעשות השתדלות לפרנסה, עכ\"ז כל השתדלותו הוא וחמושים-מן השמים הזמינו שדתן ואבירם יהיו ניצים ועי\"ז יברח משה ממצרים\nהוא רק כמו זריעה בקרקע, דגם אם עומד שם כל היום וכל השנה, לא יצמח ושם נתחכם להיות גואל ישראל, ולכן לא מתו הם בג' ימי אפילה, כדי שיראו\nיותר, רק צריך לשים בטחונו בה'.\nגאולת ישראל ע\"י משה רבינו, ולבסוף נטלו את שלהם, וד' רבוא שמתו הי', מפני\nשהקב\"ה ניסה את ישראל בשתי נסיונות, א' דאף שיראו שונאיהם בג' ימי אפילה\nקדושת לוי\nלא יגעו בהם, ומי שרצה לנגוע במצרי או בממונו מת, והנסיון הב' שיאמינו\nהאור החיים-אף שרואין שהים אינו סובל דבר מת, זה הוא מפני שהים לא בשעת מכת בכורות דהצווחה היא מהמצריים, ולא לצאת מפסח ביתם.......ל\"ג\nנתקלקלה בחטא עץ הדעת דגרמה מיתה, רק הארץ, אבל ברשעים שהם מתים כי קרוב-כיון שמלו ישראל קודם צאתם ממצרים, לכן חשש השי\"ת אם יארע\nבחייהם, וכאן אצל המצריים נעשו על ידיהם קידוש ה' גדול לכן סבל אותם ולא להם מלחמה טרם עבור ג' ימים יפחדו, כי יזכרו מעשי שכם ביום השלישי, ע\"כ\nרצה לפלטן.\nהניחם ה' דרך מדבר ולא ציוה לחזור לפי החירות עד אחר ג' ימים, ומשו\"ה נענש\nאז ישיר-כשיש לאדם שמחה בלב אז נפסקת לשעה או יותר, אבל כשאדם מרע\"ה כשרצה להביא בנו ערל למצרים ולמולו שם, דעי\"ז יבינו ישראל שיש\nמדבר דיבורים בעת שמחתו, אזי מתפעלת ונתרבה השמחה יותר ויותר, לכן בני סכנה למול ולילך בדרך, ועי\"ז גם הם לא יאבו לצאת ביום מילתם................\"\nישראל כשנקרע להם הים רצו להרבות בשמחה, ע\"כ נכנסו בגדר דיבור לשיר ויקח משה-מפני כך לא נתעסקו ישראל עם עצמות יוסף מפני שכל דור\nהשירה, בכדי להרבות תענוג...\nהשביע לבניו שאחר ת' שנים יקחו עצמותיו, ולא ידעו שידלג ה' על הקץ, אך בני\nאו יאמר-עיקר שמחתינו שהקב\"ה בחר לנו לעם, והעבודה שאנו עובדים את עמרם נצטוו מאביהם ליקח עצמות יוסף, דהוא ידע שנולד מושיען של ישראל -\nבוראינו היא עצמה תענוג גדול לנו..\nועוד דמצות דבר נא קודמת לשבועת יוסף, רק דמצוה זו הי' רק מי שעבדו\nבמדרש-יכולים לומר שני פנים מה שקפץ נחשון לתוך הים, או שמסר נפשו במצרים ולא שבט לוי.\nלה', והי' רוצה לקיים צוויו וגם אם יוטבע, או שהי' לו בטחון כ\"כ שבודאי יעשה ובני ישראל-ישראל פחדו מהמצריים, מפני שלא הרגישו שפרעה רודף\nה' להם נס ולכן קפץ, והאמת הוא אופן השני שהי' בהם בטחון שבודאי ינצלו, אחריהם, ומזליהו לא חזי, אבל באמת לא ראו זאת, מפני שהמצריים היו כמו\nומכח זה הבטחון דייקא נעשה להם הנס, ובזה הבחינה צריך אדם להתנהג תמיד מתים ולכן לא הרגישו..\nשיהא בטוח בה' שבודאי יזמין לו ה' כל צרכיו, ועי\"ז ימלא ה' שיזמין לו ......כ\"ח ויאמרו-משה אמר לישראל שישובו לפני פי החירות, ויעסקו בזה במצות\nעזי וזמרת-הקב\"ה יש תענוג ממעשינו, אע\"פ שהכל הוא בעזרתו ית', ע\"פ קידוש ה', והמצוה יגן עליהם, רק חששו ישראל מה יהי' במדבר היכן יעסקו\nמשל מהרה\"צ ר' בער זי\"ע, דכשאב מנסה בנו, אם הוא רואה שבנו אין עומד במצוה זו, וע\"ז השיב להם משה, שבזה שיקיימו מה שציוה להם הלאו של לא\nבשכלו מעצמו אז האב עוזר לו, ואפ\"ה יש נחת רוח לאב, אף עזרו................ תוסיפו לראותם יהי' נחשב כאילו עשה מצוה, וזאת תגין עליהם..................\"\nאו יבואר-צריך האדם לקבוע במחשבתו, שאצל הקב\"ה אין זה יגיעה לעשות מה תצעק-מרע\"ה לא הי' רוצה להטריח כלפי מעלה, והיה ממתין לישועת ה'\nהנס, רק העיקר בנס הוא להורות שהוא אוהב את ישראל, וצריך האדם להכיר ממצרים שכבר הובטח, רק לא הי' יכול לסבול עוד תרעומת בני ישראל, ע\"כ\nשנס הוא כדרך הטבע, שה' יכול לשנות כל דבר.\nהתפלל שהקב\"ה ה' ילחם לכם היינו שימהר ישועתו כדי ואתם תחרישון, שהוא\nועלו-לעתיד כשהקב\"ה יעשה לנו ניסים, אז יעשו האומות עמנו מלחמה ויצירו ינוח מסבלות ישראל ותרעומתן\nל\"ד\nלנו, ובוודאי נדמה אז היצר הרע כהר דאם היה כחוט היו מניחים לנו לילך ויאמינו-אף שנגזר על ישראל עינוי ועבודה רבה מ\"מ נשפטו מצרים, דהם עשו\nלארצינו, אבל באמת יהיה כחוט השערה, לזה ישפוט עמם ה'.\nיותר ממה שנגזר עליהם, נמצא דאפי' בשעת הסתר פנים והעלמת עין מהרשעים,\nאכלוהו-בששת ימי המעשה השפע בא משמים לארץ ומשתלשל עד שמצמצם מ\"מ השגיח השי\"ת בעין א' פקוחה ועין א' ישנה, כ\"כ בגלות הקב\"ה משגיח על\nבעולם העשיה במעשה גשמיות, ולכן ירד המן בששת ימי חול, אבל בשבת הוא כל פסיעה ופסיעה, אלא שיש להשי\"ת כח עצירת לשתוק ולסבול עד בוא יום\nלהיפוך נעשה מן הגשמיות רוחניות ועולה ממטה למעלה, ולכן גדל תבואה אידם, ועל זה אמרו שירה מי כמוך באלים, באילמים שרואה ויודע ושותק..ל\"ד\nבשבת - אכלוהו היום, היינו אכילה הוא לשון תענוג, שעיקר התענוג יהיה היום, אי נמי כשיצאו ישראל ממצרים הלכו לכל מקום אשר יסע הענן אפי' אל\nמיום השבת עצמו ולא מדבר גשמי..\nל\"א\nהמדבר, והוא כשומע לכל מה שכתוב בתורה שבכתב, אבל אצל הים הלך הענן\nויאמר ה'-ע\"י שמצפה אדם בכל יום לשבת ומזכירו בכל יום, בזה הוא מראה מאחריהם, ואם ילכו ישראל אחריו, הי' להם לשוב אל המצרים, רק מרע\"ה אמר\nשחביבה אצלו, ואז כשהגיע השבת ישמרנו כדת שלא לחללו ח\"ו, ומפני שאמר היום לא תסעו אל מקום הענן, אלא יקפצו אל הים, ובזה וימרו על ים בי\"ס,\nמשה לישראל השבת רק ביום ו', לכן נכשלו, שלא הי' להם ................ ל\"א דשמעו אל משה נגד השי\"ת, ומ\"מ נצח משה ונעשה להם נס, ושפטו מזה לשמוע\nהנני-הצדיקים נקראים מהלכים, זולת בתפלת י\"ח נקראים עמידה, כיון שצריך אל החכמים אפי' לעבור על דברי תורה כשהשעה צריכה ל.......................\nלצייר במחשבתו שהוא עומד לפניו ית', ומתחנן אליו כבן המתחטא לפני אביו, מי כמוך-אחר כל הגדולה כביכול אצל הקב\"ה שכל המלאכים עליונים רועדים\nוכפי מה שאנו עושין למטה מעוררין למעלה, א\"כ כשאנו במדריגה של עמידה מפניו, ומספרים תהלותיו, עכ\"ז השגיח ית\"ש בפגרי הרשעים להבליעם בארץ,\nלפניו יתברך, אז גם כביכול הקב\"ה מחמת חיבת ישראל עומד לפנינו ומצמצם לתת להם מקום קבר לשלם להם זכות שיחה נאה שאמר ה' הצדיק, בזה יוצדק\nומעמיד עצמו על נקודת ישראל שהם נקודת מחשבתו אשר בשבילם עלה ברצונו הדרש של מי כמוך באילמים ששומע ושותק עד יום מועד, מזה מבינים שמה\nלברוא כל העולמות, והכל כדי להטיב לישראל והם עיקר המחשבה......... ל\"א ששתק פ\"ו שנים במצרים ועשה עצמו כמסתיר פניו, לא הי' ממיעוט היכולת,\nחת\"ם סופר\nכ\"א מי כמוך באילמים שיש מעצור וכח לראות עד עת מועד.\n\"....\nה.........\nותקח-במיתת אהרן כתי' ויבכו את אהרן כל בית ישראל, ובמרע\"ה לא נאמר\nויצעקו-לפעמים מסתיר הקב\"ה עצמו מישראל, כדי שיתפללו אליו, ומשה כל, שהי' אהרן מרוצה לעם יותר על שהיה רודף שלום, כ\"כ מצינו בשירה שהיתה\nוגדולי ישראל הבינו זאת, רק דלת העם אמרו המבלי אין קברים, ומשה רבינו מרים אחות אהרן בענין זה, שהיתה ג\"כ מרוצית לכל הנשים, ע\"כ כתי' גבה כל,\n"
    },
    {
      "page": 4,
      "text": "\nHere is the OCR of the provided Hebrew text, structured as requested.\n\n### **Header**\n\n```\nתוכן ענינים – תורת משה\n```\n\n---\n\n### **Right Column**\n\n| Entry Text                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        "
    },
    {
      "page": 5,
      "text": "כבודו יתברך לרדוף אחר פרעוש א', ולכן מגביה מקודם האומה, והוריד השר כי אני-דהקב\"ה הכביד לב פרעה וסגר בעדו שערי תשובה, וזאת היא המחלה\nעם כל המרכבה טמאה שלו לעיני כל ישראל, כדי שידעו מה פעל אל............מ'ל אשר שמתי במצרים שסגר בעדם שערי תשובה אותו לא אשים עליך, אלא\nכי אשר-ישראל האמינו בתחלה וישבו לפני פי החירות על מנת שפרעה ירדפם אדרבא אני ה' רופאיך רק יש לחוש לתגבורת יצר הרע כי כל הגדול מחבירו יצרו\nוה' יעזרם, רק כיון דבמצרים בשעת מכת בכורות נתן להם הקב\"ה מצות כדי גדול הימנו, ע\"כ הבטיח ה' שיושיע וימול לבבם דהבא לטהר מסייעין לו .... מ\"ד\nשינצלו בזכות המצוות האלו בשעת מפלת שונאים, לכן עתה כשקרב פרעה כי אני-ע\"פ משל רופא שבא לו שכר לשנה, אז הוא משגיח שלא יחלו האנשים\nוחילו, ועדיין לא נצטוו בשום מצוה לעסוק ובמה ינצלו, ע\"כ צעקו, לכן א\"ל ההם, כ\"כ מפני שהקב\"ה מרחם עלינו ונשבע שלא לכלותם, מפני כך צונו מה\nמרע\"ה שהוא מצוה להם לא תעשה של לא תוסיפו לראותם עוד עד עולם, לאכול ומה שלא לאכול, ומוכרח לרפאותינו\nמ\"א\nובזכות הרהור לא תעשה הלז ינצלו.\nבשבתינו-תרעומות ישראל הי', שבמצרים הי' להם זכות שלא שינו שמם\nכי אשר-הקב\"ה עשה הנס בים סוף, דרצה הקב\"ה שיהיו לישראל מקום שיהיו ולשונם ומלבושם, ואם היו רוצים להתערב עמהם היו יכולין להסיר מעליהם עול\nיכולין לבוא שם בחזרה ולברך ולהודות שם על הנס, משא\"כ במצרים שאסורים השיעבוד, וע\"י העינוי בבחירה ורצון נפשם הי' להם שכר הרבה מזה, דאכלו רק\nלחזור לשם\nלחם לשובע ולא רצו להתגאל בפת בגם, ואם מתו אז הי' קידוש השם דהי' יותר\nמה תצעק-אף שמדרך הצדיקים שיהי' נענים ברגע בתפלה, מ\"מ אצל י\"ס חפץ נוח להם למות מלעבור על רצון ה', אבל עתה \"נפשינו\" יבישה אין כל, דאין להם\nהקב\"ה להמשיכם לים, מפני שהמצרים במים דנו את ישראל ובמים ידונו, וכ\"כ זכות מזה, שהעינוי בהכרח ולא בבחירה..\nשידעו ישראל כי לא מחכמתו של מרע\"ה אלא מאת ה' היתה זאת שהרי הורע איש לפי-נס גדול הי' אצל המן, שכל אחד בין אדם גדול כעוג, או קטן מאוד,\nכח מזלו של משה במים, ע\"כ נאמר מה תצעק אלי עתה פה דבר אל בנ\"י ויסעו ליקטו כפי מסת מדת ידם, וכל א' לפי שיעורו מצאו עומר א', כמדתו ....... מ\"ד\nאל המים..\nויותירו-מפני שהמן הודיע מה שבחורין וסדקין ממילא לא הי' דתן ואבירם\nמה תצעק-אע\"פ שאנחנו בטוחים בביאת המשיח והמתפלל הוא כמו חסרון יכולים לעשות מחלוקת בזה, לכן הותירו מן המן, כדי שאם ישאר יהי' יכולת\nאמונה, עכ\"ז צריכין להתפלל שיחיש במהרה הישועה, כ\"כ כשעמדו ישראל על בידם לעשות איזה מחלוקה.\nהים, לא הי' יכול להיות התפלה שיושעו, דבודאי יהי' להם הישועה, רק דלא הוא אשר-כשם שהכנה לשבת מביא השפעה, כ\"כ הלימוד בעניני שבת ומס'\nידעו מה עליהם לעשות, וע\"ז היו צריכין להתפלל..\nשבת מביא השפעה, בזמן לקיטת המן עסק הקב\"ה בעניני מס' שבת, ועי\"ז נתרבה\nויאר-מצינו בסנחריב שמתו כולם בליל פסח, שהיו שומעין קול שירה של המן - לכן לא אמר משה לישראל משבת קודם לקיטת המן ביום ו', שהי' רוצה\nמלאכים כשהיו אומרים שירה ועי\"ז הי' מתים, וה\"ה גם בפרעה הי' רוצים שישראל יראו מעצמם גודל קדושת שבת וברכתו..\nהמלאכים לומר שירה כדי שימותו המצריים ע\"י שמיעה זו, אבל הקב\"ה משלם שבת-בערב יו\"ט לקטו ישראל המן מצד ספק, לחם משנה, אולי לא יבאיש\nמדה נגד מדה, לפי שהמצריים השליכו בני ישראל במים לפיכך נשקעו המצריים בלילה ולא יצטרכו ללקט למחר, וכיון דאוכל נפש אם יכולים לעשות מאתמול\nבים, והי' רוצה להמית את המצריים במים מדה נגד מדה.\nיותר טוב, לכן לא הוצרך לירד המן ביו\"ט, אבל אם היו לוקטים כדרכם הי' יורד\nויבקעו-מפני כך לא נטלו ישראל את עצמות יוסף, מפני שהי' להם קבלה המן גם ביו\"ט.\nמ\"א\nמ\"א\nמ\"ב ....\nמ\"במבה.....\nמ\"ד\nמ\"ה\nמ\"ה\nמאבותיהם להיות במצרים ת' שנה והם לא שמעו מהקב\"ה בעצמו, ולצאת קודם ויהי ביום-לכן יצאו בנ\"י ללקוט ביום השביעי, דמאכל שבת הוא מוטעם ביותר\nהזמן הי' נגד קבלת אבותיהם, משא\"כ משה ששמעו מפי הקב\"ה בעצמו הוא הי' ואכלו טפי ולא נשאר מזון ב' סעודות, אבל באמת היו צריכים להבין, מהטעם\nיכול לעסוק בזה, ומזה מוכח שהיו ישראל מאמינים בקבלת אבותיהם....... מ\"ב טוב שיש במאכל שבת, דבמאכלי שבת יהי' ברכה ולא יחסר לחמם............ מ\"ה\nויאמינו בה'-באמת אין לומר שירה שמא ימעטו בשבחא דמרי, רק היות גד לבן-ז' ימים טובים בשנה הם נגד השבוע ויוה\"כ שבת עליהם, ראש השנה\nשבנ\"י האמינו בנביאות משה רבינו שהורה להם לומר, לכן אמרו שירה ולא רק הוא ערב שבת, וא' דסוכות מוצאי שבת שושביני' של יום השבת, ויש להם ערך\nבדור ההוא רק בכל הדורות.\nושווי מה, כי בר\"ה מתחילים ימי הכפרה, וא' דחג הסוכות נקרא ראשון לחשבון\nזה אלי-ע\"פ משל מחובת הלבבות, שבתחילה שבחו ישראל להקב\"ה 'זה אליי עוונות, שמיני עצרת הוא יום ב' יש לו שיווי עם שבועות יום ה', ב\"ה הם ימי\nשלא ידעו שבח יותר, אבל כשנכנסו לארץ אז פתחו בשירה ביותר, שראו קריאת התורה, א' וז' דפסח נגד יום ג' וד', דימים הללו מסוגלים לימי המעשה\nשהקב\"ה משגיח על אומה שפילה כמונו.\nלחזור אחר פרנסתו ולכן נאמר במן כזרע ג'ד' שהי' נס המן גדול כיציאת מצרים\nד' ימלוך-התפלל משה רבינו הלואי ימלוך ה' לעולם ועד, דהעוה\"ז הוא ים וכקריעת י\"ס.\nסוער על באי עולם, ועם ה' בעמדם בים הזה בעוה\"ז, מ\"מ עומדים ביבשה ואינם ויאמר-עיקר שמו של יהושע מנעוריו הי' 'יהושע', אבל אח\"כ כשגדל לחשיבתו\nטובעים במצולותיו, אבל הרשעים המה סוס פרעה ופרשיו מרכבה לס\"ם, המה קראו אותו הושע, ובפ' מרגלים קרא אותו משה על שמו שהי' באמת......\nבאו אל תוך הים של העוה\"ז, ולבסוף נהפך להם לרוע, כיון ששב עליהם מי הים והיה-במלחמת עמלק לא היו ישראל זכאים, ע\"כ בלי תפלה לא הי' בטוח\nוטבעם במצולותיו, אבל בנ\"י לעולם המה ביבשה אפי' בתוך הים...............מ\"ג שינצחו, ותפלת משה רבינו הי' על ישראל שישובו אל ה', וכשירים ידו להתפלל,\nותען להם-באמת לנשים לא הי' נס של קריעת ים סוף גדול כ\"כ, מפני שנגאלו אז נשמע תפלתו והיו משעבדים לכם לשמים וגבר ישראל, וכשראה משה כי גבר\nעל ידן ובזכותן, והטבע הי' מוכרח להן, רק מה שאמרו שירה, הי' מפני שראו עין ישראל, חשב שכבר הוכן לכם, והניח ידו לעשות כהודיה לה' על מפלת עמלק,\nבעין מפלת שונאיהם, שזה אינו בטבע גם להם\nאך מיד חזרו ולא שיעבדו לבם לאביהם שבשמים, ולא הועילו שירות ותשבחות\nמ\"ו\nמ\"ו\nמ\"ו\nויבואו-צריך האדם להמתין בבטחון עד שיבוא הישועה המצטרך לו, ולא של מרע\"ה, ע\"כ וגבר עמלק, עד שחזר והרים ידיו בתפלה.\nלחטוף דברים מקודם בלי משפט, וזה ששאלו ישראל מה נשתה, אם ימצאו להם ויקרא-הקב\"ה לא הסיר השגחתו מישראל אפי' רגע א', משא\"כ מהמצריים כדי\nמתוקים אח\"כ, או שישתו עכשיו מים המרים, ואחר שהשכילו דצריכים להמתין שיטבעו הסיר השגחתו, אבל באופן שיתקיימו ויטבעו בים סוף - מפני שרפו\nאז נמתקו המים, ולמדם בלי ליתן עיניו בממון חביריו.\nישראל מן התורה, מפני כך לא עשה ה' עם עמלק כמו שעשה עם המצרים. מ\"ו\nשם שם-עד שבאו ישראל אל הים הי' שוללים זה את זה, כיון שהם שאלו\nבת עין\nממצרים כלי כסף, ולא האמינו אז באמונה שלימה שיהי' זאת להם לחלוטין, ולא\nקנו איש את כליו ושמלותיו, וכל הקודם זכה וחטף את חבירו, אבל אחר ולא נחם-הקב\"ה שומר את ישראל מכל חשש נזק ופגם, ואף שלא יפגמו\nשהאמינו בה' ובמשה עבדו ואמרו שירה על גאולתם, כתיב שם לו חק ומשפט, במחשבה, כמו אב שיש לו בן חביב.\nשיחזיקו בשלהם בקנין גמור, ולא יחטפו עוד זה מזה מאומה.\nנבכים-כשניתנה תורה לישראל, היו אז בהזדככות כ\"כ עד שלא היה מקום\nהנחמדים-כדי שישראל ישיגו מתיקות התורה, הטעימן הקב\"ה מקודם עם שלא ראו שם אלהות, והאמינו שאם יעדר מדבר אחד חיות אלוה רגע מיד\nכסף וזהב, וגם טעמו טעם המן, ואח\"כ כשקרכו לפני הר סיני הבינו שיפה קורת יתבטל, והיו בבחינת פנים אל פנים, ואם יהיה אדם בבחי' זו בשעת למודו בתורה\nרוח מהתורה, יותר מכל התענוגים שטעמו\nאזי גם התפלה תהיה נשמעת מיד, ויותר מכהן הגדול שנכנס לפני ולפנים כי\nמ\"ד\nמ\"ד\nמ\"ז\n"
    },
    {
      "page": 6,
      "text": "This is a full and accurate transcription of the Hebrew text from the provided image, which appears to be a table of contents (תוכן עניינים) for Torah summaries. The text is organized into two columns, which are presented separately below for clarity.\n\n### **Right Column**\n\n**[Unnamed Section]**\n*   **א'** - **מדרך העולם שהאדם מתפלל לה' רק כשנחסר לו דבר, וכשמלא ה' מבקשו אז אינו מתפלל עוד, אבל באמת צריך האדם תמיד להתפלל על הגאולה, וכ\"כ להשגת הורא שהוא אין סוף**...................................................נ\"ב\n*   **א'** - **איש ואשה-האדם צריך לתת שבח והודי' לה', בזה עצמו שזכה שיש לו יכולת להודות לה', והחסד הוא גדל גדול יותר מכל החסדים שאדם זוכה**....נ\"ב\n*   **ב'** - **כתיב ואת-תולדות האדם הוא כמו קפה, והוא ספר דברי הימים לפני ממ\"ה הקב\"ה, וצריך האדם לעיין בכל דרכיו, שלא יהי' בו פסול ח\"ו**........................נ\"ב\n\n**חדושי תר\"מ**\n*   **א'** - **ישיר-לבן נשאר השירה שאומרים אותו בכל יום, מפני הגעגועים שהי' לישראל אז לשורר תמיד**...................................................................................נ\"ב\n*   **א'** - **ישיר-כל יהודי לא נברא אלא לקרש המחשבה שלו**................................נ\"ב\n*   **ב'** - **צדיקים-שבת שירה, נחשב כמו יום טוב**....................................................נ\"ב\n*   **ג'** - **וילכו-בני ישראל הלכו במדבר ג' ימים בלי תורה, ולא נעשה תורה ממעשיהם, כמו שנעשה בקרעית ים סוף, לכן תקנו רבותינו שלא יעבור ג' ימים בלי קריאת התורה, זכר לזה, ובזה יהי' תיקון על ביטולה**...................................................נ\"ב\n*   **ד'** - **מן הוא-בני ישראל קיימו גמילות חסדים במן, שעשיר תאר לעני את הטעם של מאכלים טובים, וע\"ז הרגישו העני**..................................................................נ\"ב\n*   **ה'** - **הרה\"ק מקאצק-צריכים ליגע בפרשיות של יציאת מצרים כמו בתוספות**...........................................................................................................נ\"ב\n*   **ו'** - **ויקרא שם-החטא שרדפו ישראל למים, הי' דעכשיו לא צמאו למים, רק דאגו מקודם מה יהי' כשיצמאו, וזה גרם שנצמאו, דלא הי' להם לדאות מקודם**......נ\"ב\n\n**כתב סופר**\n*   **א'** - **ויאמינו בה'-עד שלא האמינו ישראל במשה, לא הי' מקרר זה אמונה שלימה בה',"
    },
    {
      "page": 7,
      "text": "עטרת ישועה\n**והעומר-צריך האדם** להכין עצמו קודם התפלה, אבל אם האדם עוסק בצרכי העולם קודם התפלה, מי הורשה לו לומר כביכול לה' 'ברוך אתה', וצריכים לקיים קודם התפלה מצות עשה של ואהבת לרעך כמוך, וזה קאי על הקב\"ה שנייחד עצמינו לעבוד ולדבקה בו.\n..ס\"ב\n\n**אך פרי תבואה**\n**ויאמר משה-העיקר הוא** בטחון בה', וגם אפילו רשעים אם הם תולים בטחונם בה' היו נוושעים, לכן אמר משה לישראל אל תראו, דהעיקר שיהיו בטוחים בה', וי\"ז וראו את ישועת ה'......\nנ\"ז ....\n\n**ויבואו-כמו הרופא** שנותן לחולה סמים שהחולה מבין שהם לטובתו, ונותן לו ג\"כ סמים המרים, שהחולה אינו מבין אותם, רק שהוא סומך על הרופא, ואם לא ישמע להרופא בודאי לא יכול לקבל רפואה, כן השי\"ת נתן לנו התורה שהיא רפואת הנפש והגוף על דרך זה, דאם הי' כל התורה בהבנה בודאי הי' כל אחד מקבלה, וכן אם הי' בלי שום טעם כלל, ודאי לא הי' שום אדם מקבלה, רק עי\"ז הוא נסיון, והחכם מקבלה שידע דכמו שהמשפט הוא ראוי ונכון, כן החוקים הם בודאי ג\"כ נכונים אף שאין אנו מבינים אותם.\nנ\"ח\n\n**עוד י\"ל-רק בעניני רוחניות** צריכים לעשות כל ההשתדלות להשיגו, אבל לא בעניני גשמיות, לכן במן בימי חול נאמר לא העדיף המרבה וכו', דכל ההשתדלות כלא היו, אבל בשבת שהוא מצוה, אז היו צריכים ללקט מערב שבת........... נ\"ח\n\n**בית הלוי**\n**אז ישיר-השירה שאמרו** ישראל, העיקר הי' לא מה שניצלו מהמצריים, רק שזכו הם שהיו הכלי חפץ שעל ידם נתקדש שמו ית'\nנ\"ט\n\n**אמת ליעקב**\n**ויהי בשלח-יש צער** להקב\"ה כשאדם מדמה בעצמו ששלח כבר היצה\"ר ממנו, ובאמת הקב\"ה שולח לנו נסיונות, רק כדי שעי\"ז יהיו מוכנים בכל פעם בכלי זיין נגד היצה\"ר.\nנ\"ט...\n\n**ופרעה-משה רבינו אמר** לישראל אצל הים, שאע\"פ שנראה כצרה גדולה, אעפ\"כ בל ייתייאשו רק חזקו ונתחזקו וקראו אל ה', וכן הוא בכל דור.........נ\"ט\n\n**עזי וזמרת-אם האדם** עושה חשבון על מה ששלח לו הקב\"ה הצרה, מיד יקל עליו צערו ויצמיח עי\"ז הישועה.\nס'\n\n**ויאמר-מרבע\"ה אמר** לישראל, שאע\"פ שנראה להם כהסתר דאחר כל הניסים שראו, נחסר להם לחם, דזה הוא רק אחיזת עינים והכל הוא רק טוב..............ס'\n\n**מלחמה-עיקר מלחמת** עמלק בבני ישראל היה לטמאם ברית קודש, ע\"כ רמז התורה דעו כי מלחמה לה' בעמלק מדר דר, דכיון דמלחמה היא בענין שמירת הברית, אותה המלחמה עצמה יהיה בכל דור, ובפרט בדור אחרון עיקבא דמשיחא נתגבר המלחמה הזאת רח\"ל.\nס'\n\n**מהרי\"ד בעלזא**\n**ויאמר ה'-האדם צריך** להאמין שגנוז בכל התיבות שמתפלל יותר ממה שהוא מכוון, וישתדל שיהי' לו שייכות והתחברות עם תיבות התפלה.\nס\"ח\n\n**זה אלי-כשרואה אדם** מצבו בשעת עשיית המצוה האיך הוא עומד, יכול לבוא לידי עצבות ח\"ו, אבל כשהוא מתבונן שלעתיד יעזור לו ה' שיעשה תשובה שלימה, בזה יוכל לחזק עצמו, ועי\"ז יבוא לידי שמחה.\nס\"א\n\n**אמר אויב-פרעה הי' רוצה** לפתות את ישראל שישנו שם לשון מלבוש ועי\"ז ישיגם, וזהו ר\"ת אחלק של\"ל, שם לשון מלבוש, אבל לא עלתה בידו...........ס\"ב\n\n**עבודת יששכר**\n**ותקח מרים-לזאת לקחה** מרים התוף, לרמז על דור האחרון אשר לא יהי' להם מוחין האיך להתפלל, ויועיל להם ג\"כ התפלה בלי כוונה, כמו התוף שאין צריכין להשתמש בהמוח, רק להכות עליו, והוא השיר והזמר.\nס\"ב\n\n**והכינו את-אם מכין אדם** עצמו למצוה, אזי מה שיביא מהעצם קיום מצוה יקבל אותה ה' לרצון, ואף אם הוא אינו בשלימות.\n............\nס\"ב.....\n\n**עטרת ישועה**\n**ויהי-כל שלימות הדבר** מביא לידי העדר כמו פרי שנתבשל באילן מביא הרקבון, כ\"כ אם יש לאדם עושר ונכסים בלי חסרון יוכל ח\"ו לבוא לידי העדר, אבל כשנותן צדקה וחסר לו מממונו, אז אינו נקרא בשם שלימות ואינו מביא לידי העדר וחסרון, וע\"כ הי' בכח ישראל ליקח ביזת הים כי אז ראו בשעת קריעת ים סוף שעיקר היא מצות צדקה, וגם המה יקיימו מצות צדקה, ולא יזיק להם מה שלקחו ביזת הים..\n..ס\"ב\n\n**שפת אמת**\n**ענין-ע\"י שחזרו ישראל** ליך למצרים, נבחנו בנ\"י שכוונת שמחתם בהגאולה הוא רק לשם שמים, ולא רק בשביל גאולת הגוף....\nס\"ה\n\n**בפסוק-הראה הקב\"ה לישראל** אצל הים, שבצרה הזאת יהי' ישועה לישראל לכל הדורות, ובזה שכתוב 'אשר', הוא כמו יישר כח שעמדו בהנסיון.......... ס\"ה\n\n**בפסוק ויאמינו-עיקר האמונה** בכל הניסים היא, שעי\"ז לא יחטא האדם, וכפי חוזק האמונה זוכין אל האמת, והאמונה שהשיגו ישראל אז שיעשה ה' עמנו בכל הדורות ניסים, וכמו שהם אמרו שירה על להבא, כ\"כ אנו כפי האמונה בכל יום במה שעשה לנו הקב\"ה לשעבר, יכולין להתדבק בשירה הזאת.\nס\"ה\n\n**פרי צדיק**\n**ויהי בשלח-המנהג שנותנים** מזונות לבניו אחר החתונה, כדי שילמדו תורה ויהי' נבלעת התורה בלבם גם אח\"כ כשילכו לעסוק במשא ומתן.\nס\"ו\n\n**שבת זו-תיקון פגם הברית** הוא בשבתות אלו ימי השובבי\"ם, ובפרט בשבת זו שקורין השירה וחל בחודש שבט..\nס\"ח\n\n**דברי יחזקאל**\n**מדרש הים-מפני זה עוזר** ה' הצדיק להתגבר על יצרו, מפני שיש לו רצון לקיים מצות בוראו, משא\"כ הרשע..\nס\"ח\n\n**מהרי\"ד בעלזא**\n**בהפטרה-צריך האדם להתבונן** קודם התפלה שפלות עצמו וגדלות הבורא, רק אינו ידוע מה קודם, לכן העצה שיכלל האדם את עצמו עם הכלל ישראל, ועי\"ז יכול להודות לה'.\nס\"ח\n\n**ארן עדת**\n**ולא נחם-הקב\"ה לא רצה** להנהיג את ישראל ע\"י תפלת צדיק שהוא בשפלות ועצבות, דצדיק כזה קרוב הוא שעל ידו יפלו בעצבות ח\"ו, ויחזרו ח\"ו לסורם מחמת העצבות, לכן ויסב אלקים כו' דרך 'המדבר' רומז למנהיג, י\"ם סו\"ף, אותיות מיוס\"ף, ע\"י מנהיג שהוא ממדת יוס\"ף, שהי' תמיד בשמחה, והיינו משה, דאף שהי' בבחי' מה, אבל זה הי' רק בפנימיותו נגד הקב\"ה, אבל בגלוי נגד העם נהג נשיאותו ברמה ובשמחה.\nס\"ט\n\n**ולא קרב-אילו הניח הקב\"ה** למלאכים שיאמרו שירה בשעת טביעתן של מצריים בהיותם מפרפרים, הי' השר שלהם אומר שהקב\"ה חפץ במיתתן ואינו מחכה לתשובתן, והי' להם תירוץ שמפני זה לא הרהרו בתשובה ברגע האחרון עכ\"פ, לכן לא הניחם לומר שירה עד אחר כלות טביעתן שנאבדו בלא תשובה, ואז אמרו שירה לקיים באבוד רשעים רנה..\nס\"ט\n"
    },
    {
      "page": 8,
      "text": "Of course. Here is the full OCR of the Hebrew text, structured as a table of contents with section headers and entries.\n\n### Right Column\n\n**ויקצוף-משה** קצף על ישראל כשהותירו מן המן, דע\"י ה' בטל מהם נסיון תמידי ללקוט דוקא לאותו יום, דראו בזה דבלאו הכי יתליע, אבל הקב\"ה לא קצף, דיהי' גם גדול בזה שיראו שבעצם לא יתליע, ולכן אין מניחין ג' לחם כשהל יו\"ט אחר שבת, דלא הי' נסיון בזה, ואין בזה שום הוראת נס.................. ע\"ה\n\n**למען א\"י יחוש** אדם דרק כשהוא כבר מורגל בתורה אז הוא מושגח מה', ואז אינו צריך לדאוג, אבל בלאו הכי צריך לדאוג על פרנסתו, דראינו שבנ\"י כשיצאו ממצרים היו ג\"כ בלי תורה ואעפ\"כ הוריד להם השי\"ת מן במדבר.................. ע\"ה\n\n---\n### דברי ישראל\n\n**עוד שם-דה** שהאדם צריך להיות רגיל לומר, 'גם זו לטובה' הוא רק כשאדם אומר זאת על עצמו, אבל על חבירו צריך לעזור בכל מה שיכול, והוא ע\"ד צרות ולא יתנח' אלקים שלא נתנ' הקב\"ה אצל ישראל במר נחום איש גם זו שהי' רגיל לומר גם זו לטובה.................................................................................................. ע\"ה\n\n**וחמושים-ישראל** עלו ממצרים בשמחה מפני שעלו ממ\"ט שערי טומאה, ולא מחמת שהי' להם כסף וזהב, ואותיות 'וחמשים', הוא 'ושמחים'..................... ע\"ה\n\n**או יאמר-הקב\"ה** הי' רוצה שיהי' לישראל הכסף בדרך שאלה, לרמוז בזה דאין מלוין לו לאדם לא כסף וזהב אלא תורה ומעשים טובים בלבד, וזאת רמז משה בשלקח עצמות יוסף, בשעה שעסקו ישראל בביזת מצרים........................... ע\"ה\n\n**לא ימיש-עיקר** התפלה הוא ביום, ועסק התורה הוא בלילה, והעוסק בתורה ותפלה, הם משלימים זה לזה, דעד שלא ישקע התלהבות התפלה, עולה התלהבות התורה, ובו חוזר הלילה ולא תכבה.................................................. ע\"ה\n\n**ובני ישראל וגו'** ישראל יוצאים ביד רמה, היינו שבנ\"י ישראל זענין יוצא או מחייבם אוזף די האנר, ולא צריכין יותר........................................................... ע\"ה\n\n**ופרעה-בשפרעה** ראה שאינו מועיל מה שעונה את ישראל, רצה להיות אוהב לישראל, וזה ופרעה הקריב, היינו קרבות ואהבה, אבל הקב\"ה לקח העמוד הענן ויבא בין מחנה מצרים ובין מחנה ישראל ולא קרב זה אל זה, שעשה פירוד ושנאה ביניהם שלא יהיה שום קרבות זה אל זה......................................................... ע\"ה\n\n**וייראו-כשאדם** הוא בודד, אז גם תפלה בלי כוונה הוא חשוב מאוד בעיני ה', והיינו תפשו אומנות אבותם, היינו שתפשו תפלתם בחפזון ובלי כוונה, ואעפ\"כ נתקבלה ברצון, דאין הקב\"ה בא בטרוניא עם בריותיו................................... ע\"ה\n\n**או יאמר-הקב\"ה** הי' מתאוה לתפלת שבנ\"י צעקו במצרים 'אבא אבא', ולכן גזרה פרעה שיזרקו אחריהם ולא הי' להם מוח להניח להתפלל רק 'אבא אבא', והיינו תפשו אומנות 'אבותם', אז אמר הקב\"ה לכך הייתי מבקש לשמוע אותו הקול שכבר שמעתי במצרים................................................................................... ע\"ה\n\n**עוד-כשמלמד** אדם יתבו על ה', הוא פועל יותר מתפלה, ולכן אמר ה' למשה מה תצעק אלי, וכמו שבמדרש השליכו ישראל ילדיהן בשדות, וזה פעל בלי שום תפלה........................................................................................................... ע\"ה\n\n**וירא-כשאדם** מאמין שאין מקרה בעולם רק הכל בהשגחה פרטיות מן השמים, ואפילו תנועה קלה ואפילו צעד רגליו ספורים בחשבונות, אז ע\"י אמונה זו ניצול ממקרה שחורה ועומדת נגדו, אם אינו מתנהג בעניניו ברצונו ודעתו, ועיקר האמונה הוא ליזהר מלהרהר חלילה על שום דבר שהוא במקרה וחרמן...................... ע\"ה\n\n**עוד אמר** מקור הוא סגולה לאמונה, ובמדרגות שמעמיקין המקום נתרבה אפיקורסות, ורמז 'ואשינו בה' / בג' מקוה'................................................... ע\"ה\n\n**או יאמר-המן** הי' שורש הפרנסה, והעיקר לפרנסה הוא אמונה, ולבוא לידי אמונה הוא ע\"י כח התורה........................................................................... ע\"ה\n\n**אבלוהו-אם** אוכלים מאכלי שבת לשם קדושת שבת, הוא פועל כמו בחול ע\"י תעניתים וסיגופים, וזה רק כשאוכל לשם אכילה גסה - הרגשת שבת נתחלק, פשוט עם מרגישים כשאוכלים הפירוש של שבת, חסידים, כשאומרים פסוקי דזמרה, וצדיקים העיקר שעת אכילה........................................................... ע\"ה\n\n**היום-רמז** מוסר, דיום שמת מן האדם אין באפשרי למצוא עוד, וזה 'היום' לא תמצאוהו בשדה......................................................................................... ע\"ה\n\n**קח צנצנת-עיקר** שורש הפרנסה הוא מכח התורה, לכן הניחו צנצנת א' לפני העדות, ומי שהוא דבוק בתורה אז כל ישראל מתפללין עליו, כמו שאומרים בקדוש דרבנן, על ישראל ועל רבנן ועל כל מאן דעסקין באורייתא וכו' והא לכון חיי אריכין ומזוני רויחי וכו'........................................................................... ע\"ה\n\n---\n### Left Column\n\n**ויאמר ה'-הקב\"ה** את ישראל כמדבר ומכלכלם במן, כדי להרגילם באמונה ובבטחון, כמדבר ששמה דע\"ז שכל חריצות שבעולם לא יועיל להם להשיג מזונם, והיו מוכרחים לישא עיניהם להשי\"ת בתפלה שיזמין להם פרנסתם, וענין המן נוהג גם עתה, וכמו שהמן ירד דרך נסי' מבלי עזר מפאת האדם, כן יורד גם עתה באופן פלא, אלא שא\"א לקבלו רק ע\"י אמונה שיאמין שאין השתדלות האדם עושה שום פעולה כלל בענין הפרנסה - הנסיון על בטחון הוא כשעוסקין בתורה ותפלה, ועיקר ביטול תורה ותפלה בא מדאגת מחר שאדם ירא ודואג שלא יהי' לו לאחר זמן - מי שאינו יודע לעסוק בתורה, יעסוק באמירת תהלים בכל יום וימשך גם בזה את פרנסתו כמו בתורה.................. ע\"ה\n\n**ויהי משנה-לשון** 'ויהי' מצינו אצל שלשה משפטים, יוסף הצדיק, משה רבינו, מרדכי הצדיק, ושלשה אלו היו המשפיעים הראשיים בישראל, יוסף השפיע פרנסה, משה גאולה מעבדות לחרות, ומרדכי השפיע חיים, כי הוציאם ממות לחיים, וזהו מרומז אצל לקיטת המן של שבת, לשון ויהיה לשון שמחה, ורומז לשלש השפעות, שעל ידי שנכבד את השבת כראוי, ישמח ד' את לבנו בשפעת חיים ומזוני, ונזכה לגאולה השלימה................................................................ ע\"ה\n\n**איש אל-מה** שנצטוו ישראל שלא להותירו מן המן למחר, רק ללקוט בכל בוקר, זה הי' לנסות בטחונם שאינם דואגים דאגת מחר, וכשעמדו בנסיון זה, יהי' חשוב לפני הקב\"ה כאילו הקטירו קטורת, והקריבו קרבנות ונסכים..................... ע\"ה\n\n**עוד טעם-צריך** האדם להתפלל תמיד על השגת מזונו, ואף לאחר שכבר השיג אותו, צריך ג\"כ לתפלה שיהי' לו המזון לבריאות ולא יזיקנו ח\"ו.................... ע\"ה\n\n---\n### שם משמואל\n\n**במדבר-מפני** זה אצל הים, קדמה תפילת ישראל לה', יותר מתפילת משה רבינו, מפני שתפילתם הי' מלב נשבר בתכלית, דמשה ידע שלא יהיו ישראל נאבדים, ולא הי' לו כל כך לב נשבר כשישראל שראו עצמם נאבדים לגמרי................ ע\"ה\n\n**או ישיר-בשעה** שאמרו ישראל שירה על הים הי' בהם שכינה מדברת מתוך גרונם, ולא היו צריכים אפי' כלי הדיבור לזה, רק מפני שהבינו עצמם לזה בראייתם עם עזרתם השי\"ת........................................................................... ע\"ה\n\n**ויאמר ה'-ע\"י** תמימות בנ\"י בישראל שהלכו במדבר בארץ לא זרועה, נעשו בני ישראל דבוקים בה', וטומאתו שהי' להם פרחה, וכמו מקוה שמשיקין מים טמאים נעשו טהורין, ולישראל נחשב זה לחסד, לכן שורת הדין לעשות עמהם ג\"כ חסד ובעין הים....................................................................................... ע\"ה\n\n**ה' ילחם-בטחון** הוא למעלה מהאמונה, וע\"י הבטחון ממשיכים הישועה, ולכן אמר משה לישראל ואתם תחרישון דתהיו בטוחים בה', ויושעו................... ע\"ה\n\n---\n### קרן לדוד\n\n**ויהי-מה** שהטביע הקב\"ה את מצרים בתוך הים, היה מפאת אהבת ישראל, כמו אב שעושה נקם במי ששלח ידו בבנו, ורק מחמת אהבה בנו יגדל חרונו, ולא מחמת שיש איזה שנאה על האיש, דכיון דמן שנשבע ה' באשמורת הבוקר בזמן שהרחמים גוברים ע\"כ הוא מפאת אהבת ישראל............................................. ע\"ה\n\n**ויאמר-עיקר** האמונה מתקיים רק על ידי שמירת תורה והמצוות, וראי' לזה דבמצרים גם אחר שהאמינו חזרו מזה, ולא נתקיים אצלם האמונה, רק אחר קבלת התורה................................................................................................ ע\"ה\n\n---\n### משך חכמה\n\n**עוד וימררו-אמונת** ישראל בתורה לא הי' ע\"י האותות, רק מפני שראו הנבואה, ולכן במצרים שלח להם אמונה מתוך מופתים הי' הכיכול קל, ולכן בפ' התפילין קודם מ\"ת לא נאמר וקשרתם, דלא הי' הקשר נגלה עדיין.................. ע\"ה\n\n**עושה-כאשר** נתודע דבר חדש או יש בו התפעלות, ואח\"כ כשנתודע חכמה יותר גדולה אז העבר אין בו פלא עכשיו, כ\"כ האותות שיעשה עמנו ה' לעתיד לבא, יהי' כלי דוגמה מנס של העבר........................................................... ע\"ה\n\n**ה' ימלוך-כל** האדם הוא עלעקטערי אלקי לעשות מה שהמוח רוצה, אבל אם הוא דבוק תמיד אז לא יעזבו האברים, וזה הוא העיקר שיקבלו ישראל לעתיד לבא, דכשתתנוצץ במוח של האדם לעשות איזה מצוה, תיכף יתעוררו האברים בלתי שום מפריע................................................................................................... ע\"ה"
    },
    {
      "page": 9,
      "text": "או יאמר-ע\"ד צחות משה רבינו אמר \"ראו\" כי ה' נתן לכם את השבת, מפני\nששבת הוא זווג של ישראל, ואסור לאדם שיקדש את אשה עד שייראנה, שמא\nיראה בה דבר מגונה וכו', וע\"י שראו שהניחו המן מערב שבת עד הבוקר ולא\nהבאיש ורמה לא היתה בו, אז ראו שאין בו דבר מגונה.\nפ\"ג\nתורת אבות\nואמר-כשקועים בארציות אינם יכולם לדבר דברי תורה ותפלה, וזה נבוכים הם\n'בארץ', אז סגר עליהם המדבר, היינו דיבורי תו\"ת.\nפ\"א\nזה אלי-אם יהודי אומר 'זה אלי', אזי אומר הקב\"ה 'ואנוהו' אדור עמו, אבל אם\nאומר אלקי אבי, שאינו מתייגע להשיג כ\"א ממעשי אבותיו, ע\"ד מצות אנשים\nמלומדה, אומר הקב\"ה וארוממנהו הנני מתרומם עמו ....\nפ\"א\nאמר-היצה\"ר מכניס רצונו באדם, ומביא אותו לעצבות ומרה שחורה, אבל\n'מיט א בלאז פון התחזקות', יכולים לדחות כל העצות של היצר.......................\nפ\"א\nלמען-העיקר הנסיון שילכו עם ה' גם שהוא בבחי' 'לא', שאין לו מוחין, וזה למען\nאנסנו הילך בתורתי אם 'לא'.\nפ\"א\nאכלוהו-צריכים להתענג מיום השבת עצמו, זיך אנעסן מיט'ן טאג, וזה אכלוהו\nהיום\nפ\"א ...\nבית אברהם\nמה תצעק מרצון עד המעשה הוא מרחק גדול, וצריכים לבקש מה' להכניס\nהרצון בהמעשים.\nפ\"א\nמה תצעק בצעקה לבד לה' אינם משיגים כלום, והוא כמו הכיכר שבוכה והוא\nנכנס אל הפח, רק צריכים להסיע מדרך הרעה ולנטות לדרך הטוב............פ\"א\nמה תצעק-הקב\"ה מוכן תמיד לעזור לאדם, אבל צריך האדם לעשות מה\nשמוטל עליו, ואז יוכל לצעוק לה'..\nפ\"א\nויאמר-אצל הרה\"ק מוויטעפסק זי\"ע, הי' כל שבת אצלו כאילו לא מעולם לא\nהי' שבת, ולא תהי' עוד שבת אחרת - צריך לחוס על כל רגע של שבת, דשבת\nאסורה בהסח הדעת, ק\"ו מתפילין שיש בהן אזכרות אסור בהיסח הדעת, שבת\nקודש שהיא שמא דקודשא ב\"ה על אחת כמה וכמה..\nפ\"ה\nדברי שלום\nאז-צריך האדם להתבונן קודם התפלה, ולא להיות רץ וחוטף התפלה, דתפלה\nרחמי הוא, וצריכין לערוך מקודם מחשבתו בישוב הדעת קודם התפילה, וזה אז\nישיר, בלשון עתיד לעמוד מקודם ולכוון מה שהולך לעשות ולתקן בתפילותיו\nולכוון לבו, וזה שר לא נאמר אלא ישיר לעתיד.\nפ\"ה\nארץ צבי\nאז ישיר-ע\"י זכירת יציאת מצרים מעוררים כל ההארות שהיו אז, ונמשך לנו\nהארה מגאולה העתידה - מפני זה אין נוסח הברכה של קידוש היום כמו בלילה,\nמפני שביום צריכין כבר להרגיש הקדושה בלי שום דיבור.\nפ\"ח\nמה שנשאר-כל השפעת הפרנסה הוא מן המן, וכל עסק הפרנסה הוא רק\nלבוש, וכמו שהרה\"ק מבארדיטשוב הראה פעם לאומנים, כשעשו חשבון\nהוצאות והכנסות, שהיציאה יתירה על הפרנסה, ורק לה' הישועה והוא נותן\nלחם לכל בשר.\nשיר ידידות\nויאמינו-ע\"פ מעשה מהרה\"ק מצאנז זי\"ע, שהאמונה צריך להיות קודם\nבהקב\"ה, ואח\"כ ובמשה עבדו.....\nפ\"ג\nשיר חדש\nבהפטרה-לכן אמר יעל בא ואראך, ולא לך, דרצתה לרמז לו שאיסור היא\nלילך אחורי אשה, רק הוא ילך לפניו.\nפ\"ג\nטיב לבב\nויהי בשלח-יש מדרשים חלוקים, דאמרו חז\"ל אין חבוש מתיר עצמו מבית\nהאסורים, מזה נראה שעצה טובה לשלוח הגדול מחוץ לעיר, שלא יהא גם הוא\nחבוש, ואז יהא תפלתו עליהם יותר נשמעת, אבל מצינו ג\"כ שיפה תפלת החולה\nמתפלת אחרים עליו והיא קודמת להתקבל, ולפ\"ז יותר הגון שישאר המגין עם\nעמו ויהא גם הוא בצרה ותהי' תפלתו יותר מקובל, וזה הי' כוונת פרעה במה\nשלא השתעבד גם עם שבט לוי, דידע שהם בני עליה ומתפללים על צרתם של\nישראל, וסבר שאם ישתעבד עמהם ויהיו גם כן בצרה עי\"ז יעשה תפלתם יותר\nרושם למעלה, שתפלת החולה יותר נשמעת, אבל כשראה שהשי\"ת הושיעם\nוהוציא את בני ישראל ממצרים, אם כן ידע שטעה בדעתו, ויותר היה לו לשעבד\nגם את שבט לוי, ע\"כ התחרט על מה שלא שיעבד גם בהם..\nפ\"ג\nויהי בשלח-כשמתחברים ישראל אל האומות אז יש להם שנאה עלינו, אבל\nאם מתרחקים מהם אין שנאתם גדולה כ\"כ, ולכן הסכים פרעה לשלח את העם\nדסבר דפשוטי עם יסיתו את ישראל לעבוד ע\"ז, אבל כשראה שגם הם נתעלו, אז\nרדף אחריהם, והיינו ויהפך לבב פרעה ועבדיו אל 'העם'\nפ\"ג\nדברי יואל\nויהי ידיו-אמונה צריך להיות למעלה מהרגשת הלב, ובשכר שיהודי משתמש\nבאמונה יתירה, מאיר לו ה' את האמונה כשמש.\nפ\"א ...\nויהי בשלח-רוב בני אדם נשפעין מהנהגת המדינה, דשרים של מעלה הם\nהמביאים לכל תאות יצה\"ר, ורצונם למשוך האדם אחר תאוות יצה\"ר, ובפרט\nלאיש הישראלי, לכן כיון שידעו ישראל שמעשיהם של האומות במקומות שהם\nנמצאים הם מקולקלים מכל האומות, וייראו ממלחמה של ל\"א מלכים שיתגברו\nעליהם כל שרי האומות להחטיאם, ע\"כ חשבו שטוב להם יותר לחזור למצרים,\nשהמצריים כבר ראו את היד הגדולה ונסי קרי\"ס שעשה השי\"ת בשביל ישראל,\nושם יֵקֵל להם להתגבר מול תאוות האומות, דכבר נכנעו מפני כובד המכות וגם\nראו התגלות הנסים שעשה ד' לאהבתו את ישראל, אבל רצון הבוי\"ת הי' למנוע\nמחשבה זו מלבם, וכן הקיפם מ' שנה במדבר, שיהיו התורה נבללת בגופן, וע\"י\nהתוה\"ק ישיגו דרך האמת ורצון הבורא, ולא יעלה על דעתם לשוב...............פ\"ד\nבאופן אחר-תועלת וטובה גדולה נצמח לכל דורות ישראל, ממה שהקיפם\nהקב\"ה לישראל דרך המדבר, וזה הטעם מספיק שהוצרכו ישראל לסבב דרך\nהמדבר, דאלמלי הלכו דרך ארץ פלשתים, הי' נשלל מהם הנסיון הגדול, ובזכות\nהנסיון הזה יתקיימו ישראל בגלותם ויבואו לעוה\"ב - פן ינחם העם בראותם\nמלחמה, היינו מלחמת היצר הרע שהוא שרו של עמלק, ועי\"ז ושבו מצרימה,\nיחזרו לבחי' מעשה ארץ מצרים, ע\"כ הכין הקב\"ה כח וזכות של דור המדבר\nלהיות זכותן וכח קדושתם מגינא ומצלת לכל דורות ישראל, והסיבן דרך\nהמדבר, ויהי' להם הזכות של לכתך אחרי במדבר - כל עוד שהאדם מצטער\nומתחרט על המחשבה רעה, השי\"ת עוזרו ומצילו מידי מעשה, אבל אם ח\"ו ימצא\nמרגוע לנפשו ויקבל תנחומין על התהפכות המחשבה, אז עלול ח\"ו ליפול\nלתועבת מצרים.\nבאופן אחר-גודל איסור שלא ליקח ממון מאנשים שאינם מהוגנים, וע\"י\nנעשים משוחד להם, וזה הי' נסיון של א\"א כשהשליכו נמרוד לכבשן האש,\nדהבע\"ד הסית אותו שאם ישתחוה פ\"א, יוכל אח\"כ להמשיך לבות בנ\"י לאמונה\nאבל אברהם לא רצה בזה, וויתור על הכל - בביזה גם אם נותנים דעת על זה\nיכולים לעשות משוחד, ושוחד שאני משאר עבירות, דגם מי שאוהב השוחד ויש\nלו אפי' רק דמיון לקבלו נעשה עי\"ז עצמו משוחד.\nבאופן אחר-אלמלי הי' גאולת מצרים גאולה שלימה, אז לא הי' מתחרט פרעה\nמה ששלח ישראל מארצו, שהי' משיג גודל התועלת שהגיע גם אליו מה שנתקדש\nעל ידו ש\"ש, ורק מפני שלא הי' עדיין השלימות הגמור, לא באו האומות להשגה\nזו לראות האמת, ע\"כ צווח ווי על ששלח את ישראל מארצו - הי' למשה רבינו\nכח תפלה שהי' מכריח הגאולה כמו ר' חייא ובניו, ועד\"ז היה תפלת משרע\"ה\nכשעמדו ישראל על הים, ורצה לפעול בתפלתו שתהי' גאולה נצחיות, אבל לא\nהניחוהו מן השמים דלא הי' אז עדיין זמנו - אחד מסימני הגאולה הוא, כשיראו\nישראל מטה משה רבינו ביד הגואל העתיד, הוא הגואל האמיתי, ולטעם זה אמר\nהקב\"ה למשה הרם את מטך ונטה את ידך, מחמת כח הגאולה שנגנז בו עד שיבוא\nמלך המשיח, וע\"כ הי' נס קריעת ים סוף ע\"י נטיית ידו של משרע\"ה ולא\nבאמצעות המטה, וצוהו הקב\"ה להרימו כלפי מעלה להורות שבחי' הגאולה הוא\nביד הקב\"ה לבדו, עד שיעלה רצון העליון וימסרנה ביד מלך המשיח................\n"
    },
    {
      "page": 10,
      "text": "\nHere is the OCR text from the provided image, structured as requested.\n\n### Section Header\n**ויחי בעלות**\n\n---\n\n### Right Column\n\n1.  **Entry Index:** \"ויאמר ה'\"\n    **Description:** פגם חטא הדעת חמור מאד, על שבמקום אחד כתב התוה\"ק דאינו מועיל תשובה, אבל הכוונה הוא רק על תשובה מיראת העונש, אבל תשובה מאהבה מועיל גם על חטא זה, והאמתא דהכללית הוא מיסוד המים שנקראת תאוה, וכ\"כ אם מתעורר נפש האדם להתפוקק להשי\"ת להיות דבוק בו ית' בממ\"נ באמת, גם זה נמשך מיסוד המים, יכול עי\"ז לעלות למדריגות גמורות ונשגבות, ותכלית כל הנסים שנעשו לישראל הי', להעלות יסוד המים לשרשה, באהבה והשתוקקות להשי\"ת ע\"י הביכות הנס והכרה אמיתית בהשפעה אלקית, וגם של קר\"י ים סו\"ף ג\"כ להמשיך פעולה זו, דהי' צריך להפריש את ישראל מתאות מצרים, ועי\"ז גם קר\"י ים הופרשו מתאות האמורים וכ"
    },
    {
      "page": 11,
      "text": ".............\nישמח ישראל\n..ק\"י\nוישאו-כשראו בנ\"י השר של מצרים הי' להם פחד, אבל משה אמר להם ששר\nלהם המן על פתח אהליהם, הי' יורד המן גם בשבת, לכן הציווי והי' ביום הששי הוא הלחם-העיקר באכילה הוא, שעי\"ז יהי' לו כח לעבוד ה', וזהו מה שהמן\nנאמרה על תנאי, דמשרע\"ה הי' מצפה שלא יצטרך לצוות את ישראל בכך, נשתנה טעמו, היינו טעם הרוחניות שבו הי' כפי כוונת האדם.\nדעדיין הי' תלוי בבחירתם אולי יזכו במעשיהם וירד להם המן גם בשבת - החיוב ויבא-יעקב אבינו רמז במה ששם אפרים לפני מנשה, שלא יסורו מדברי חכמים,\nעל כ\"א מישראל אף אם עוסק במו\"מ או במלאכה, לקבוע עיתים לתורה, ואל רק מחמת אריכת הימים במצרים נשכח מהם דבר זה, מפני כך הי' כח לעמלק\nידמה בעיניו שבזה מחסר פרנסתו, רק צריך להאמין שנמשך השפעת פרנסה לבא להלחם עם ישראל, מפני שרפו ידיהם מהגדרים וסייגים - עמלק נתן בלב\nלעוסקי תורה מפ' המן, והנסיון במן הי' ג\"כ בעסק התורה בטענה מהיכן נתפרנס, ישראל לבטל טבילת עזרא, כי הטבילה מעורר טהרת הלב.\nאבל כיון שנמשך מירידת המן השפעת פרנסה לכל עוסקי תורה, נדחה טענת זו,\nוהנסיון הזה קיים לכל הדורות הילך בתורתי, היינו לקבוע עיתים לתורה, ואף\nבדור שכח התורה בשפלות מאוד, מ\"מ אם הולכין בדרך התורה וקובעים עיתים\nלתורה כ\"א כפי יכולתו, נמשך לו השפעת פרנסה מהמן ...\nובוקר-פרעה וחכמיו חשבו דלהכות עם רב בחנם, תהי' בגידה גדולה, לכן רצו של ישראל הוא ה' בעצמו, וכאשר ראו ישראל מה שהשיגו אז ע\"י אמונה אף\nלעשותה דרך חכמה, שלא ירגישו בזה, לכן לקח יועצים צדיקים, ועי\"ז יכלו במצב השפלות, אז אמרו שגם בגלות יכולים לזכות למדריגת גבוהות........קי\"א\nלחפות על מעשיהם הרעים ולתרץ רשעתם, ויתרו השיג כוונתם וברח מהם, אבל במד\"ר-לזה משליכין להעופות מזונות בשבת שירה, כי כמו שהעופות אין להם\nאיוב לא השיג זאת, ואולי הי' לו חשבון שמוטב יותר לישב עמהם ולהציל מה לחשוב איך מפרנסים, כ\"כ אנו צריכים לידע כי ה' הוא הזן אותנו\nדאפשר, אבל עכ\"ז נחשב לו כל הרשעות שעשו המצריים כאילו הוא הי' עושה,\nע\"י שישב ונתחבר להם וחיפה על מעשיהם, ועי\"ז נתן חיזוק לרשעים לעשות\nרשעתם, ואף שלפעמים מיחה קצת במחאה חלושה אין זה נחשב לכלום, ה' ילחם-ע\"י שאדם מתפלל מורה שיש לו אמונה, ממילא בא לו עי\"ז הישועה,\nדבלא\"ה לא היו דבריו נשמעים כלל, ועל זה הגיע לו עונש שנדון ביסורים - רק ואין התפלה שינוי רצון רק בא לו הישועה בשכר האמונה - וע\"י שמירת שבת\nע\"י שנמצאו איזה מישראל שהתחברו עם הערב רב, עי\"ז קבלו חיזוק ואומץ מורים ג\"כ האמונה, ואז יבא הישועה גם בלי תפלה.\nלהסית את ישראל, ואותם שנתחברו אל הע\"ר הם היו הגורמים אל התלונה,\nוזולתם לא היו ביכולת הערב רב בעצמם להסית את ישראל - לכן לא זכה יתרו\nלהיות במ\"ת מפני שהוא הי' גם באותו עצה מתחלה, וטרם שברח הי' להמצריים\nקדושת יום טוב\nערוגת הבשם\nקי\"ב\nקי\"ג\nחיזוק ע\"י ישיבתו ביניהם, והוי לי' חלק קצת בשעבוד ישראל, ואף שברח ועשה עוד נראה לי כשאדם מודה לה' על העבר, אם אינו מקבל תוספת עבודה על\nתשובה מ\"מ לא הי' ראוי לשמוח בשמחתם - הערב רב לא עברו את הים כלל, העתיד אין זה נאות, וזה הי' שבח של ישראל יורדי הים שאמרו שבח על העבר,\nשהם לא האמינו בכח הנס שיעמוד הים כך עד שיעברו, והי' להם חשבון שיחזרו ובאותו פרק קבלו עליהם ג\"כ עבודה על העתיד.\nקי\"ד\nלמצרים בלית ברירה, רק אחר שעלו ישראל מן הים באותו צד עצמו שירדו ויאמר משה-במצרים היו הדיבורים של ישראל בלי חיות, אבל כשיצאו\nנתחברו עוה\"פ הע\"ר לישראל והלכו עמהם במדבר - חששו ישראל שהמצריים ישראל ממצרים נשאם השי\"ת למדרגות גבוהות והרגישו ישראל חיות\nיעלו מן הים ע\"י התשובה שעושין, ולא מחמת חסרון אמונה ח\"ו אמרו כן, רק בהדיבורים, וזה הוא פי החירות, וכיון דתשובה צריך להיות באותו מקום ובאותו\nשבערך דור דיעה נחשב גם מחשבה זו למיעוט אמונה, דאחר שמרע\"ה צוה להם זמן וכו', נטל מהם הקב\"ה כח הדיבור ולא היו יכולים להוציא דיבורים זכים\nלילך אין להרהר, וע\"כ קראו אותם חכז\"ל לקטני אמנה.\nק\"ה\nמפיהם, והתחילו לצעוק לה' בדיבור כזו, והקב\"ה שמע דיבורם וקרע להם הים,\nובתפלה זו פעלו ישראל, שגם בתפלה כזו בימי הגלות יהיו נענים.\nקי\"ד\nתורת אמת\nבמדרש-בכל הענינים צריך האדם להתיישב מקודם, אם יעשנו או לאו, ולא\nויאמינו-אמונה הוא כשיש מסך המבדיל ואעפ\"כ הוא מאמין, וזה הי' במצרים יהי' נבהל, אבל בעבירה צריך לברוח ממנה, וראי' ממה שראינו אצל יוסף\nכשראו ישראל שהמצריים הם מושלים בכיפה, ואעפ\"כ האמינו אז בה', אבל הצדיק, וממנו למדו ישראל כשיצאו ממצרים, דהי' להם להתבונן מקודם באיזה\nאח\"כ כשהודו מצריים בה' לא הי' ניכר הבדל ביניהם, לכן עשה ה' לפני ים סוף, דרך יצאו כדי שחא יהיו צריכים לנס, אבל כיון שהרגישו שאם יתמהמו שם\nשיתגברו עוד הפעם באמונה, ויהי' זה האמונה תקוע כיתד שלא תמוט...... ק\"ח ישתקעו ח\"ו בטומאה, לכן ברחו משם בחפזון.\nקח צנצנת-פרשת המן הוא לרמז לדורות, שבכל דבר שיהי' קשה על האדם, אז ישיר-צריך האדם לגדל בניו בתורה מקודם שמלמדים אותם חכמות\nיתנהג כמו בקריעת ים סוף להיות להם אמונה ואזי יוושעו בכל, דבאמת הכל חיצונים, דהרושם שנחקק בתחילה בלב האדם קשה למחות מזכרונו, ומפני זה\nמוכן לאדם רק שחסר אמונה, ותיכף כשיאמין אז נתעורר השפע................ \"ח מקודם מתן תורה רצה השי\"ת שיקנו ישראל בנפשם עיקרים שבלעדם א\"א\nלהתחיל בעבודת ה', והוא אמונה ובטחון - הודאה בדרך שיר הוא לרמז, דכמו\nמגן אברהם\nאצל ניגון יש כמה מיני קולות ובהתחברותם נעשה ניגון יפה ונעים, לכן בזה\nאז-השירה בים ע\"י משה רבינו וישראל הי' גם הכוונה בשביל ישראל בדורות שראו ישראל שכל השעבוד הי' להם לטובה.\nקט\"ו\nהבאים, וזהו מה שאנו אומרים השירה בכל יום, ובפרט בשבת שירה, צריכים ויבא עמלק-היצר הרע כשרואה שאין יכול להפריע את האדם ע\"י גדלות, אז\nלהתאמץ בתפלה שיכנסו ישראל לארץ, וע\"י תפלות ישראל מוסיפים כח מנסה אותו ע\"י שיפיל את האדם לשפלות, דמעשיו אינם רצויים לה', אבל באמת\nצריך האדם להיות שמח בחלקו גם בעניני תורה ומצות, וגם המעט שחננו ה' הוא\nחסד ה' עליו, ולולי עזרתו לא הי' לנו אף כל דהו.\nכביכול בפמליא של מעלה.\nייטב לב\nט\"........\nבהקדם-כשאדם רוצה להתפלל אז יאחז רעדה ובושה האיך להתפלל, אבל\nצבי לצדיק\nקט\"ו...\n............\nכשרואה שגם המלאכים אומרים קדושה, א\"כ אין סוף לענוותנותו ית', לכן א\"י-מכיון שישראל היו נותנים עצמם למיתה כשקפצו לים, הראו בזה שכבר\nהאדם ג\"כ ראוי לומר.\nנתייאשו מן החיים, ונחשבו עי\"ז לבריאה חדשה, ובזה עצמם נשלם הזמן... קי\"ח\n"
    }
  ]
}